<a href="https://clarusway.com/contact-us/"><img align="center" src="https://i.ibb.co/B43qn24/officially-licensed-logo.png" alt="Open in Clarusway LMS" width="110" height="200" title="This notebook is licensed by Clarusway IT training school. Please contact the authorized persons about the conditions under which you can use or share."></a>

<hr>

<a href="https://lms.clarusway.com/mod/lesson/view.php?id=2463&pageid=4531&startlastseen=no"><img align="center" src="https://i.ibb.co/6Z5pQxD/lmss.png" alt="Open in Clarusway LMS" width="70" height="200" title="Open Clarusway Learning Management Sytem"></a>

<a href="https://github.com/clarusway/DS-DE-0322-Students/blob/main/3-%20Classes%26Labs/2-DAwPY/DAwPy_S01_(Numpy_Arrays).ipynb"><img align="left" src="https://i.ibb.co/n3HWyQX/github-logo.png" alt="Open in Clarusway GitHub" width="90" height="150" title="Open and Execute in Clarusway GitHub Repository"></a>

<a href="https://nbviewer.org/github/4dsolutions/clarusway_data_analysis/blob/main/DAwPy_S1_%28Numpy_Arrays%29/DAwPy_S1_%28Numpy_Arrays%29.ipynb"><img align="right" src="https://i.ibb.co/48wtV8c/nbviewer-badge.png" alt="Open in nbviewer" width="100" height="100" title="Open and Execute in nbviewer"></a><br/>

<hr>

<p style="text-align: center;"><img src="https://i.ibb.co/Rpz9L36/clarusway-logo-black.png" width="500" height="200" class="img-fluid" alt="CLRSWY_LOGO"></p>

<p style="text-align: center;"><img src="https://i.ibb.co/XS0bxSH/best-bootcamps.png" width="300" height="200" class="img-fluid" alt="CLRSWY_LOGO"></p>

<p style="background-color:#E51A59; font-family:newtimeroman; color:#FDFEFE; font-size:130%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>

<p style="text-align: center;"><img src="https://i.ibb.co/99DQ3TY/DS-Courses.png" class="img-fluid" 
alt="CLRSWY_Courses"></p>

<img src=https://i.ibb.co/6gCsHd6/1200px-Pandas-logo-svg.png width="600" height="200">

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:200%; text-align:center; border-radius:10px 10px;">Data Analysis with Python</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#060108; font-size:150%; text-align:center; border-radius:10px 10px;">Session - 04</p>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#E51A59; font-size:200%; text-align:center; border-radius:10px 10px;">Pandas DataFrames</p>

<a id="toc"></a>

## <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Content</p>

* [IMPORTING LIBRARIES NEEDED IN THIS NOTEBOOK](#0)
* [DATA FRAMES](#1)
* [CREATING A DATA FRAME](#2)
    * [Creating a DataFrame Using the Lists of Data & Columns](#2.1)
    * [Creating a DataFrame Using a Numpy Arrays](#2.2)
    * [Creating a DataFrame Using a Dictionary](#2.3)
    * [The Examination of Some Attributes on Data](#2.4)
* [INDEXING, SLICING & SELECTION](#3)    
* [CREATING A NEW COLUMN](#4)    
* [REMOVING COLUMNS](#5)
* [REMOVING ROWS](#6)
* [SELECTING ROWS & COLUMNS USING .loc[ ] & .iloc[ ] ](#7)
* [CONDITIONAL SELECTION](#8)
    * [One Conditional Statement](#8.1)
    * [Two or More Conditional Statements](#8.2)
    * [Conditional Selection Using .loc[ ]](#8.3)
* [reset_index() & set_index()](#9)
* [Multi-Index & Index Hierarchy](#10)
* [Some Other Useful Methods with Iris Dataset](#11)
* [THE END OF THE SESSION-04](#12)

## <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Importing Libraries Needed in This Notebook</p>

<a id="0"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Once you've installed NumPy & Pandas you can import them as a library:

In [1]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings("ignore")  # to suppress all warnings

- ``import warnings``: This imports the warnings module, which is part of Python's standard library and provides a way to issue warning messages.
- ``warnings.filterwarnings("ignore")``: This function call tells Python to ignore all warning messages that would normally be printed. This can be useful when we want to focus on the output of your program without being distracted by warnings.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#FF0000; font-size:125%; text-align:left;"><strong>üì¢ Caution ‚ùó‚ùó‚ùó</strong></p>


- Ignoring warnings can sometimes hide important issues in our code, so use this approach judiciously. It's generally better to address the underlying causes of warnings rather than suppressing them.

## <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Data Frames</p>

<a id="1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

<img src=https://i.ibb.co/xJKnhHq/dataframes.png width="600" height="200">

[Source](https://www.geeksforgeeks.org/creating-a-pandas-dataframe/)

A DataFrame is a **``two-dimensional``** data container, similar to a Matrix, but which can contain **``heterogeneous data``**, and for which **``symbolic names``** may be associated with the **``rows``** and **``columns``**. DataFrames are the workhorse of Pandas and are directly inspired by the **``R``** programming language. We can think of a DataFrame as a **``bunch-collection of Series``** objects put together to **``share the same index``**. 

### Why use Pandas?

Data scientists make use of Pandas in Python for its **following advantages**:

- Easily handles missing data
- It uses Series for one-dimensional data structure and DataFrame for multi-dimensional data structure
- It provides an efficient way to slice the data
- It provides a flexible way to merge, concatenate or reshape the data
- It includes a powerful time series tool to work with

In a nutshell, Pandas is a useful library in data analysis. It can be used to perform data manipulation and analysis. Pandas provide powerful and easy-to-use data structures, as well as the means to quickly perform operations on these structures.

**[Everything About Pandas- 100 Code Snippets and Tricks](https://medium.com/analytics-vidhya/everything-about-pandas-100-code-snippets-and-tricks-443e5ae59e81)**

[SOURCE01](https://pandas.pydata.org/pandas-docs/stable/user_guide/dsintro.html), 
[SOURCE02](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html), 
[SOURCE03](https://morioh.com/p/2528ac775b1b), 
[SOURCE04](https://www.datacamp.com/community/tutorials/pandas-tutorial-dataframe-python), 
[SOURCE05](https://www.guru99.com/python-pandas-tutorial.html), 
[SOURCE06](https://www.tutorialspoint.com/python_pandas/python_pandas_dataframe.htm), 
[SOURCE07](https://realpython.com/pandas-dataframe/) &
[SOURCE08](https://towardsdatascience.com/a-simple-guide-to-pandas-dataframes-b125f64e1453)<br>
[VIDEO SOURCE01](https://www.youtube.com/watch?v=zmdjNSmRXF4), 
[VIDEO SOURCE02](https://www.youtube.com/watch?v=F6kmIpWWEdU) &
[VIDEO SOURCE03](https://towardsdatascience.com/pandas-dataframe-basics-3c16eb35c4f3)<br>

**Now let's use Pandas library to explore this topic!**

## <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Creating a DataFrame</p>

<a id="2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

A **``DataFrame``** is a **two-dimension collection of data**. It is a data structure where data is stored in **tabular form**. Datasets are arranged in rows and columns; we can store multiple datasets in the data frame. We can perform various arithmetic operations, such as adding column/row selection and columns/rows in the data frame.

We can import the DataFrames from the external storage; these storages can be referred to as the SQL Database, CSV file, and an Excel file. We can also use the lists, dictionary, and from a list of dictionary, etc.

### <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Creating a DataFrame Using the Lists of Data & Columns</p>

<a id="2.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

<img src=https://i.ibb.co/s2y31w8/Creating-Pandas-Data-Frames-from-Lists-and-Dictionaries.png width="700" height="200">

[Creating Pandas DataFrames from Lists and Dictionaries](https://pbpython.com/pandas-list-dict.html)

In [2]:
# Define a list named data
data = [1, 3, 5, 7, 9, 18]

# Display the data
data

[1, 3, 5, 7, 9, 18]

### <p style="background-color:#FFFFFF; font-family:newtimeroman; color:#008000; font-size:125%; text-align:left;"><strong>ü•≥ Our First DataFrame:</strong></p>


In this session, we will learn to create the DataFrame in multiple ways. Let's understand these different ways.

- **``pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=None)``**

In [3]:
# Create a DataFrame with the specified column name

display(pd.DataFrame(data))
pd.DataFrame(data, columns=['column1'])

    0
0   1
1   3
2   5
3   7
4   9
5  18

   column1
0        1
1        3
2        5
3        7
4        9
5       18

- **``DataFrame Creation``**: The pd.DataFrame() function takes the data list and converts it into a DataFrame.
- **``Column Naming``**: The columns parameter assigns the name 'column1' to the single column in the DataFrame.
- **``Index``**: By default, Pandas assigns a numerical index to the rows, starting from 0.

<hr>

**Let's remember how to create a Series with a specified name in Pandas:**

In [4]:
# Create a Series with a specified name

display(pd.Series(data=data))
pd.Series(data=data, name="column_1")

0     1
1     3
2     5
3     7
4     9
5    18
dtype: int64

0     1
1     3
2     5
3     7
4     9
5    18
Name: column_1, dtype: int64

- **``Series Creation``**: The pd.Series() function takes the data list and creates a Series.
- **``Naming``**: The name parameter assigns the name 'column_1' to the Series, which is displayed as part of the output.
- **``Index``**: By default, Pandas assigns a numerical index to the elements of the Series, starting from 0.

<hr>

### <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Creating a DataFrame Using a Numpy Arrays</p>

<a id="2.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [5]:
# Creates a NumPy array with values starting from 1 to 23 (exclusive) in steps of 2, 
# and then reshapes this array into a 3x4 matrix.
data = np.arange(1, 24, 2).reshape(3, 4)

# Display the Numpy array
data

array([[ 1,  3,  5,  7],
       [ 9, 11, 13, 15],
       [17, 19, 21, 23]])

- **``np.arange(1, 24, 2)``**: This function generates an array of values starting from 1, up to but not including 24, with a step of 
- **``.reshape(3, 4)``**: This method reshapes the flat array into a 2-dimensional array with 3 rows and 4 columns.

<hr>

In [9]:
# Create a DataFrame with specified column names
df = pd.DataFrame(data=data, columns=['var1','var2','var3','var4'])

# Display the DataFrame
df

   var1  var2  var3  var4
0     1     3     5     7
1     9    11    13    15
2    17    19    21    23

- **``DataFrame Creation``**: The pd.DataFrame() function takes the NumPy array data and converts it into a DataFrame.
- **``Column Naming``**: The columns parameter assigns the names ['var1', 'var2', 'var3', 'var4'] to the corresponding columns in the DataFrame.
- **``Index``**: By default, Pandas assigns a numerical index to the rows, starting from 0.

<hr>

### <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Creating a DataFrame Using a Dictionary</p>

<a id="2.3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [10]:
# Generate random integers for s1, s2, and s3

s1 = np.random.randint(2, 10, size=4)
s2 = np.random.randint(3, 10, size=4)
s3 = np.random.randint(4, 15, size=4)

- **``np.random.randint(low, high, size)``**: This function generates random integers.
  - **``low``**: The inclusive lower bound of the random integers.
  - **``high``**: The exclusive upper bound of the random integers.
  - **``size``**: The number of random integers to generate.
<hr>

- **``s1``**: Contains random integers between 2 (inclusive) and 10 (exclusive), so possible values are 2 to 9.
- **``s2``**: Contains random integers between 3 (inclusive) and 10 (exclusive), so possible values are 3 to 9.
- **``s3``**: Contains random integers between 4 (inclusive) and 15 (exclusive), so possible values are 4 to 14.
<hr>

In [11]:
# Display the first Numpy array

s1

array([8, 9, 3, 5])

In [12]:
# Display the second Numpy array

s2

array([8, 8, 6, 3])

In [13]:
# Display the third Numpy array

s3

array([10,  9,  6,  8])

In [14]:
# Create a dictionary with the generated arrays (ROW ORIENTED)

myDict= {'var1':s1, 'var2':s2, 'var3':s3}

- **``Dictionary Creation``**: The dictionary myDict contains three key-value pairs, where:
  - **``'var1'``** maps to the NumPy array s1.
  - **``'var2'``** maps to the NumPy array s2.
  - **``'var3'``** maps to the NumPy array s3.
- **``Accessing Values``**: You can access the arrays using their corresponding keys. For example, myDict['var1'] will return the array assigned to var1.

<hr>

In [15]:
# Create a DataFrame from the dictionary
df = pd.DataFrame(myDict)

# Display the DataFrame
df

   var1  var2  var3
0     8     8    10
1     9     8     9
2     3     6     6
3     5     3     8

- **``DataFrame Creation``**: The pd.DataFrame(myDict) function takes the dictionary myDict and converts it into a DataFrame.
- **``Columns``**: Each key in the dictionary ('var1', 'var2', and 'var3') becomes a column in the DataFrame.
- **``Indexing``**: By default, Pandas assigns a numerical index to the rows, starting from 0.

<hr>

### <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">The Examination of Some Attributes on Data</p>

<a id="2.4"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [16]:
# Display the first two rows of the DataFrame

df.head()

   var1  var2  var3
0     8     8    10
1     9     8     9
2     3     6     6
3     5     3     8

- **``head(n) Method``**: The head(n) method returns the first n rows of the DataFrame. In this case, n is 2, so it returns the first two rows.
  - **``Quick Inspection``**: This is helpful for getting a quick glance at the structure and contents of the DataFrame without displaying the entire dataset.

<hr>

In [17]:
# Display the last two rows of the DataFrame

df.tail(2)

   var1  var2  var3
2     3     6     6
3     5     3     8

- **``tail(n) Method``**: The tail(n) method returns the last n rows of the DataFrame. In this case, n is 2, so it returns the last two rows.
  - **``Quick Inspection``**: This is helpful for checking the final entries of your DataFrame, which can be useful in understanding the data's structure or confirming that data has been added correctly.

<hr>

In [24]:
# Display a random sample of two rows from the DataFrame

df.sample(2)

   var1  var2  var3
0     8     8    10
3     5     3     8

- **``sample(n) Method``**: The sample(n) method returns a random sample of n rows from the DataFrame. In this case, n is 2, so it returns two randomly selected rows.
- **``Randomness``**: Each time we run the code, you may get different rows, which is useful for testing or exploring the data without bias toward a specific order.

<hr>

In [25]:
# Display the column labels of the DataFrame

df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

- **``df.columns``**: This property returns an Index object containing the names of the columns in the DataFrame. In this example, it returns ['var1', 'var2', 'var3'].
- **``Usage``**: We can use this to check the names of the columns, which is helpful when we want to reference or manipulate specific columns in our DataFrame.

<hr>

In [26]:
# Iterate over the column labels and print each one

print("Column labels of the DataFrame:")
for i in df.columns:
    print(i)

Column labels of the DataFrame:
var1
var2
var3

- **``Iteration``**: The loop iterates over df.columns, which contains the names of the DataFrame's columns. For each column name, it prints the name.
  - **``Readability``**: This approach provides a clear and simple way to display the column names one per line, enhancing readability, especially if there are many columns.

<hr>

In [27]:
# Iterate over the column labels and print the mean of each column

print("Mean of each column in the DataFrame:")
for i in df.columns:
    print(df[i].mean())

Mean of each column in the DataFrame:
6.25
6.25
8.25

- **``Column Iteration``**: The loop goes through each column name in df.columns.
- **``Mean Calculation``**: For each column, df[i].mean() computes the mean of the values in that column.
- **``Formatted Output``**: The print statement uses formatted strings to clearly indicate which mean corresponds to which column.

<hr>

In [28]:
# Display the index labels of the DataFrame

df.index

RangeIndex(start=0, stop=4, step=1)

- **``df.index``**: This property returns the index labels of the DataFrame. By default, Pandas assigns a numerical index, which in this case is a RangeIndex starting from 0 to 3 (for four rows).
- **``Usage``**: We can use this to check the row labels, which can be particularly helpful when we want to reference or manipulate specific rows in our DataFrame.

<hr>

In [29]:
# Create and display a list of index labels

[i for i in df.index]

[0, 1, 2, 3]

- **``List Comprehension``**: The expression [i for i in df.index] iterates over each index label in df.index and creates a list containing those labels.
- **``Result``**: The resulting list contains the index values, which can be used in various ways, such as for referencing specific rows or for further analysis.

<hr>

In [34]:
# Rename the columns
df.columns = ['new1', 'new2', 'new3']

# Display the updated DataFrame
df

   new1  new2  new3
a     8     8    10
b     9     8     9
c     3     6     6
d     5     3     8

- **``Column Renaming``**: The line df.columns = ['new1', 'new2', 'new3'] assigns a new list of names to the columns of the DataFrame.
- **``Number of Columns``**: Ensure that the length of the new list matches the number of columns in the DataFrame. If there are three columns, we need to provide exactly three new names.
- **``Updated DataFrame``**: The DataFrame's columns are now renamed, which can help in making the DataFrame more understandable and maintaining clarity in our data analysis.

<hr>

In [31]:
# Rename the index
df.index = ["a", "b", "c", "d"]

# Display the updated DataFrame
df

   new1  new2  new3
a     8     8    10
b     9     8     9
c     3     6     6
d     5     3     8

- **``Index Renaming``**: The line df.index = ["a", "b", "c", "d"] assigns a new list of labels to the index of the DataFrame.
- **``Length Matching``**: Ensure that the length of the new index list matches the number of rows in the DataFrame. In this case, there are four rows, so we need exactly four new labels.
- **``Updated DataFrame``**: The DataFrame's index is now renamed, which can help in better identifying the rows when performing analyses or visualizations.

<hr>

In [35]:
# Rename specific columns

df.rename(columns={"new1": "a", "new2": "b"})

   a  b  new3
a  8  8    10
b  9  8     9
c  3  6     6
d  5  3     8

- **``Column Renaming``**: The method df.rename(columns={"new1": "a", "new2": "b"}) changes the names of the specified columns from "new1" to "a" and from "new2" to "b".
- **``Return Value``**: The rename method returns a new DataFrame with the updated column names. We need to assign this back to df (or another variable) to keep the changes.
- **``Retaining Other Columns``**: Any columns NOT specified in the renaming dictionary remain unchanged. In this case, new3 remains the same.

<hr>

In [36]:
# Rename specific index labels

df.rename(index={"a": 1, "b": 2})

   new1  new2  new3
1     8     8    10
2     9     8     9
c     3     6     6
d     5     3     8

- **``Index Renaming``**: The method df.rename(index={"a": 1, "b": 2}) changes the index labels from "a" to 1 and from "b" to 2.
- **``Return Value``**: Just like with column renaming, the rename method returns a new DataFrame with the updated index labels. You need to assign this back to df (or another variable) to keep the changes.
- **``Retaining Other Index Labels``**: Any index labels not specified in the renaming dictionary remain unchanged. In this case, the labels c and d remain the same.

<hr>

In [37]:
# Display the DataFrame; NO CHANGE, WHY?

df

   new1  new2  new3
a     8     8    10
b     9     8     9
c     3     6     6
d     5     3     8

In [38]:
# Display the shape of the DataFrame

df.shape

(4, 3)

- **``df.shape``**: This property returns a tuple indicating the dimensions of the DataFrame. In this case, (4, 3) means there are 4 rows and 3 columns.
- **``Usage``**: This information is useful for quickly assessing the size of your DataFrame, which can help in understanding the structure of your dataset and in planning data manipulations.

<hr>

In [39]:
# Display the number of rows in the DataFrame

df.shape[0]

4

- **``df.shape[0]``**: This expression accesses the first element of the tuple returned by df.shape, which represents the total number of rows in the DataFrame.
- **``Usage``**: Knowing the number of rows can be useful for various tasks, such as iterating through the DataFrame, performing validations, or understanding the dataset's size.

<hr>

In [40]:
# Display the number of rows in the DataFrame using "len()"

len(df)

4

- **``len(df)``**: This function returns the total number of rows in the DataFrame. It is equivalent to using df.shape[0].
- **``Usage``**: Using len(df) is a common practice in Python to quickly get the count of items in a collection, making it familiar for those who might also work with lists or other iterable objects.

<hr>

In [41]:
# Display the number of dimensions of the DataFrame

df.ndim

2

- **``df.ndim``**: This property returns the number of dimensions of the DataFrame. In the case of a DataFrame, it will always be 2 since it consists of rows and columns.
- **``Usage``**: While this property might seem straightforward, it can be useful when working with data structures that may have different dimensions (like Series, which has only one dimension).

<hr>

In [42]:
# Display the total number of elements in the DataFrame

df.size

12

- **``df.size``**: This property returns the total number of elements in the DataFrame. It is calculated as the product of the number of rows and the number of columns (e.g., for a DataFrame with 4 rows and 3 columns, size would be 4 * 3 = 12).
- **``Usage``**: This can be useful for understanding the overall size of your dataset, especially when you're dealing with larger DataFrames and want to quickly assess how much data you're working with.

<hr>

In [43]:
# Display the underlying data as a NumPy array

df.values

array([[ 8,  8, 10],
       [ 9,  8,  9],
       [ 3,  6,  6],
       [ 5,  3,  8]])

- **``df.values``**: This property returns the data contained in the DataFrame as a 2-dimensional NumPy array. Each row in the array corresponds to a row in the DataFrame, and each column in the array corresponds to a column in the DataFrame.
- **``Usage``**: This can be particularly useful when performing numerical operations that require data in NumPy array format or when interfacing with libraries that expect NumPy arrays.

<hr>

In [44]:
# Check the type of the DataFrame

type(df)

pandas.core.frame.DataFrame

- **``type(df)``**: This function returns the type of the object df. When df is a Pandas DataFrame, it confirms that the object is indeed a DataFrame and not some other data structure.
- **``Usage``**: This is useful for debugging or when working with functions that might return different types of data structures, helping you verify the type of an object before performing operations on it.

<hr>

In [45]:
# Check the type of the underlying data

type(df.values)

numpy.ndarray

- **``type(df.values)``**: This function returns the type of the object returned by df.values. Since df.values returns the data in the DataFrame as a NumPy array, the result confirms that the type is numpy.ndarray.
- **``Usage``**: This can be useful for understanding how the data is structured and for ensuring compatibility with functions that operate specifically on NumPy arrays.

<hr>

In [46]:
# Check the type of the column "new1"

type(df["new1"])

pandas.core.series.Series

- **``type(df["new1"])``**: This expression accesses the column "new1" from the DataFrame df, which returns a Pandas Series object. The output confirms that the type is pandas.core.series.Series.
- **``Usage``**: Understanding that a DataFrame column is a Series is important because Series objects have different methods and properties compared to DataFrames. This can affect how you manipulate or analyze the data.

<hr>

In [47]:
# we can check any column name whether it belongs to the DataFrame or not

# Check if the column "new2" exists in the DataFrame
"new2" in df

True

- **``"new2" in df``**: This expression checks if the string "new2" is one of the column names in the DataFrame df. It evaluates to True if the column exists and False if it does not.
- **``Usage``**: This check is useful for data validation or when dynamically accessing columns, ensuring that you don't attempt to access a column that may not exist, which would raise an error.

<hr>

In [48]:
# Check if the column "new5" exists in the DataFrame

'new5' in df

False

- **``'new5' in df``**: This expression checks if the string 'new5' is one of the column names in the DataFrame df. Since we only created columns named 'new1', 'new2', and 'new3', it evaluates to False.
- **``Usage``**: This type of check is useful for data validation, especially when you're dynamically accessing columns or working with DataFrames that may change over time.

<hr>

## <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Indexing, Slicing & Selection</p>

<a id="3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Let's learn a variety of methods to grab data from a DataFrame

In [49]:
# Import the "randn function" from the "numpy.random module".

from numpy.random import randn



<hr>

In [50]:
# creating a DataFrame by "keyword arguments"

# Set the random seed for reproducibility
np.random.seed(101)


df = pd.DataFrame(randn(5, 4), index='A B C D E'.split(), columns='W X Y Z'.split())

# Display the DataFrame
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

- **``random.seed(101)``**: sets the random seed to 101. This ensures that the random numbers generated by randn will be the same each time we run the code, which is useful for reproducibility in experiments or analyses.
- **``randn(5, 4)``**: This generates a 2D array with 5 rows and 4 columns filled with random numbers sampled from a standard normal distribution.
- **``index='A B C D E'.split()``**: This creates the index for the DataFrame with labels 'A', 'B', 'C', 'D', and 'E'.
- **``columns='W X Y Z'.split()``**: This sets the column names to 'W', 'X', 'Y', and 'Z'.

<hr>

In [51]:
# Retrieve the column 'Y'

df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

- **``df['Y']``**: This expression accesses the column labeled 'Y' from the DataFrame df. The result is a Series containing the values from that column.
- **``Output``**: The resulting Series retains the index from the DataFrame, providing easy reference to the corresponding labels.

<hr>

In [52]:
# Dot Notation OR SQL-like Syntax (NOT RECOMMENDED!)

# Retrieve the column 'Y' using dot notation
df.Y

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

- **``df.Y``**: This expression accesses the column labeled 'Y' from the DataFrame df. The result is a Series containing the values from that column.
- **``Output``**: Similar to df['Y'], the resulting Series retains the index from the DataFrame, allowing for easy reference to the corresponding labels.

<hr>

Using **``dot notation``** (like df.column_name) or **``SQL-like syntax``** for accessing DataFrame columns in pandas can **``lead to several issues``**, particularly in terms of code readability, maintainability, and potential errors. Here are some reasons why these methods are not always recommended:

- **``1. Ambiguity with Column Names``**
  - **``Reserved Keywords``**: If a column name is the same as a pandas method or attribute (e.g., df.mean), using dot notation will lead to confusion and potential errors.
  - **``Spaces and Special Characters``**: Dot notation does not support column names with spaces or special characters. For example, a column named sepal length cannot be accessed using df.sepal length, but must be accessed using df['sepal length'].

- **``2. Code Readability``**
  - **``Clarity``**: Using square brackets (df['column_name']) is more explicit and clearer, especially for those unfamiliar with the code. It clearly distinguishes between accessing a column and calling a method.
  - **``Consistency``**: Mixing dot notation and bracket notation can make the code harder to read and maintain. Consistent use of bracket notation improves readability.

- **``3. Potential for Silent Errors``**
  - **``AttributeError``**: If you mistakenly use dot notation for a non-existent attribute, you'll get an AttributeError, which can be confusing. For instance, df.nonexistent will raise an error without informing you that you meant to access a column.

- **``4. Dynamic Column Access``**
  - **``Dynamic Column Names``**: When column names are stored in variables or created dynamically, bracket notation is necessary. For example, df[column_name] works, while df.column_name does not.

- **``5. SQL Syntax Limitations``**
  - **``Limited Functionality``**: SQL-like syntax can be less expressive than pandas' native methods for complex operations, such as filtering or aggregating data.
  - **``Complex Queries``**: While SQL syntax can be intuitive for simple queries, more complex operations may become cumbersome and harder to read.

<hr>

In [53]:
# Check the type of the column 'Y'

type(df['Y'])

pandas.core.series.Series

- **``type(df['Y'])``**: This expression accesses the column 'Y' from the DataFrame df, which returns a Pandas Series object. The output confirms that the type is pandas.core.series.Series.
- **``Usage``**: Understanding that a DataFrame column is a Series is important because Series objects have different methods and properties compared to DataFrames. This can affect how you manipulate or analyze the data.

<hr>

In [54]:
# Retrieve the column 'Y' as a DataFrame

df[['Y']]

          Y
A  0.907969
B -0.848077
C  0.528813
D -0.933237
E  2.605967

- **``df[['Y']]``**: This syntax uses double square brackets to select one or more columns from the DataFrame. Since we are using a single column name within a list, the result is a DataFrame containing just that column.
- **``Output``**: The resulting DataFrame retains its two-dimensional structure, including the index and the column name.

<hr>

In [55]:
# Check the type of the column 'Y' as a DataFrame

type(df[['Y']])

pandas.core.frame.DataFrame

- **``type(df[['Y']])``**: This expression accesses the column 'Y' from the DataFrame df using double square brackets, which returns a DataFrame containing just that column. The output confirms that the type is pandas.core.frame.DataFrame.
- **``Usage``**: This is important to note when you're working with functions or methods that expect a DataFrame as input, as opposed to a Series.

<hr>

In [59]:
# df['Z', 'X']  # gives error

- Using df['Z', 'X'] raises a KeyError because the syntax is incorrect for selecting multiple columns in a Pandas DataFrame. When you want to select multiple columns, you should provide a list of column names within a single pair of square brackets.

- **``'Z'``** and **``'X'``** by enclosing the column names in a list within a single pair of square brackets.
  - **``Error``**: The error occurs with df['Z', 'X'] because it attempts to treat ('Z', 'X') as a single key, which does not exist in the DataFrame.
<hr>

#### <p style="background-color:#FFFFFF; font-family:newtimeroman; color:#FF0000; font-size:125%; text-align:left;"><strong>üì¢‚ùóüö® Be Careful; Correctly select columns from 'X' to 'Z' using .loc in the following situations rather than Basic Indexing ‚ùó‚ùó‚ùó</strong></p>


**The following statement slices the DataFrame using label-based indexing.**
- However, this syntax will NOT work as intended for selecting specific columns; instead, it will raise a KeyError if the DataFrame's index does NOT support this type of slicing OR give an enpty output.

In [61]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [60]:
# it searches index to find ["X" : "Y"]

df["X":"Z"]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

- **``Label Slicing:``**
  - Slicing with df["X":"Z"] is typically used for slicing rows based on the index labels rather than columns. In Pandas, to slice rows, you would use .loc[] for label-based indexing.
  - If we want to select specific columns, you should use double square brackets like df[["X", "Y", "Z"]].
- **``Example of Incorrect Usage:``**
  - If we try to use df["X":"Z"] directly, it will raise an error since it‚Äôs not the correct way to select columns.

<hr>

**The following statement slices the DataFrame using label-based indexing, but it is NOT the correct prefered syntax for selecting columns. Instead, this syntax is typically used for slicing rows based on the DataFrame's index labels. If we want to select specific columns, we should use a different approach.**

In [62]:
# Select rows from index 'B' to 'D'

df['B':'D']

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

- **``Row Slicing:``**
  - The expression df['B':'D'] will try to select rows with index labels from 'B' to 'D'. This assumes that the DataFrame's index includes labels 'B', 'C', and 'D'.
- **``Error or Unexpected Behavior:``**
  - If you intend to select columns, this syntax will not work as expected and may result in a KeyError if the specified labels are not found in the index.

<hr>

**The following code raises a KeyError because the syntax is incorrect for selecting multiple columns in a Pandas DataFrame.**

#### <p style="background-color:#FFFFFF; font-family:newtimeroman; color:#FF0000; font-size:125%; text-align:left;"><strong>üì¢üö® When we want to select multiple columns, we need to provide a list of column names within a single pair of square brackets ‚ùó‚ùó‚ùó</strong></p>

In [66]:
# df[['C','D']] # gives error

- **``df[['C', 'D']]``**: This syntax correctly specifies that you want to select both columns 'C' and 'D' by enclosing the column names in a list within a single pair of square brackets.
- **``Error``**: The error occurs with df['C', 'D'] because it attempts to treat ('C', 'D') as a single key, which does not exist in the DataFrame.

<hr>

**The following code slices the DataFrame to select rows with index labels from 'A' to 'C' and then select the columns 'Y' and 'Z'.**
- However, this syntax is NOT a formal way to work as intended because the first part (df["A":"C"]) is NOT using the correct prefered method for slicing rows by index labels. Instead, we should use **``.loc[]``** for label-based indexing we cover in the following sections.

In [67]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [68]:
# Select rows from 'A' to 'C' and columns 'Y' and 'Z'

df["A":"C"][["Y", "Z"]]

          Y         Z
A  0.907969  0.503826
B -0.848077  0.605965
C  0.528813 -0.589001

- **``df.loc["A":"C", ["Y", "Z"]]``**: This syntax correctly uses .loc[] to select rows with index labels from 'A' to 'C' and simultaneously specifies the columns 'Y' and 'Z'.
- **``Row and Column Selection``**: This method allows you to cleanly access both rows and columns in a single operation.

<hr>

## <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Creating a New Column</p>

<a id="4"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [69]:
# Let's remember our DataFrame

df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [70]:
# feature engineering OR feature extraction

# Create a new column 'new1' as the product of columns 'X' and 'Y'
df['new1'] = df['X'] * df['Y']

# Display the DataFrame after adding the new column
df

          W         X         Y         Z      new1
A  2.706850  0.628133  0.907969  0.503826  0.570325
B  0.651118 -0.319318 -0.848077  0.605965  0.270806
C -2.018168  0.740122  0.528813 -0.589001  0.391387
D  0.188695 -0.758872 -0.933237  0.955057  0.708208
E  0.190794  1.978757  2.605967  0.683509  5.156577

- **``Column Creation``**: The code df['new1'] = df['X'] * df['Y'] performs element-wise multiplication:
  - Each element in column 'X' is multiplied by the corresponding element in column 'Y'.
  - The result is stored in a new column called 'new1'.
- **``DataFrame Update``**: The original DataFrame df is updated to include the new column.

<hr>

In [73]:
# Create a new column 'new2' with a range of numbers from 0 to 4
df["new2"] = np.arange(5)

# Display the DataFrame after adding the new column
df

          W         X         Y         Z      new1  new2
A  2.706850  0.628133  0.907969  0.503826  0.570325     0
B  0.651118 -0.319318 -0.848077  0.605965  0.270806     1
C -2.018168  0.740122  0.528813 -0.589001  0.391387     2
D  0.188695 -0.758872 -0.933237  0.955057  0.708208     3
E  0.190794  1.978757  2.605967  0.683509  5.156577     4

- **``Column Creation``**: The code df["new2"] = np.arange(5):
  - Creates a new column 'new2' in the DataFrame.
  - np.arange(5) generates an array [0, 1, 2, 3, 4], which is assigned to the new column.
- **``Index Alignment``**: Since the DataFrame has 5 rows (with index labels 'A' to 'E'), the values from np.arange(5) will align perfectly with each row.

<hr>

## <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Removing Columns</p>

<a id="5"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [74]:
# Drop the column 'new2'

df.drop('new2', axis=1)

          W         X         Y         Z      new1
A  2.706850  0.628133  0.907969  0.503826  0.570325
B  0.651118 -0.319318 -0.848077  0.605965  0.270806
C -2.018168  0.740122  0.528813 -0.589001  0.391387
D  0.188695 -0.758872 -0.933237  0.955057  0.708208
E  0.190794  1.978757  2.605967  0.683509  5.156577

- **``df.drop('new2', axis=1)``**: This command removes the column labeled 'new2' from the DataFrame.
  - **``axis=1``** indicates that we're dropping a column.


<hr>

In [75]:
# Let's check the DataFrame if the change (drop) operation is made in place

df

          W         X         Y         Z      new1  new2
A  2.706850  0.628133  0.907969  0.503826  0.570325     0
B  0.651118 -0.319318 -0.848077  0.605965  0.270806     1
C -2.018168  0.740122  0.528813 -0.589001  0.391387     2
D  0.188695 -0.758872 -0.933237  0.955057  0.708208     3
E  0.190794  1.978757  2.605967  0.683509  5.156577     4

- **``Reassignment Needed``**: Since drop() does NOT modify the DataFrame in place by default, it's common to reassign the result back to df (e.g., df = df.drop('new2', axis=1)) to reflect the change.

<hr>

In [78]:
# Drop the columns 'new1' and 'new2'

df.drop(["new1", "new2"], axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

- **``df.drop(["new1", "new2"], axis=1)``**: This command removes the columns labeled 'new1' and 'new2' from the DataFrame.
  - **``The axis=1``** parameter specifies that you are dropping columns.
- **``Reassignment Needed``**: Similar to before, since drop() does not modify the DataFrame in place by default, you typically reassign the result back to df to reflect the changes.

<hr>

In [79]:
# Display the original DataFrame

df

          W         X         Y         Z      new1  new2
A  2.706850  0.628133  0.907969  0.503826  0.570325     0
B  0.651118 -0.319318 -0.848077  0.605965  0.270806     1
C -2.018168  0.740122  0.528813 -0.589001  0.391387     2
D  0.188695 -0.758872 -0.933237  0.955057  0.708208     3
E  0.190794  1.978757  2.605967  0.683509  5.156577     4

<hr>

**The following statement removes the columns labeled 'new1' and 'new2' from the Pandas DataFrame df.**
- The columns parameter explicitly specifies which columns to drop, making it a clear and readable way to perform this operation.

In [80]:
# Drop the columns 'new1' and 'new2'

df.drop(columns=["new1", "new2"])

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

- **``df.drop(columns=["new1", "new2"])``**: This command removes the specified columns from the DataFrame.
  - The columns parameter explicitly indicates which columns to drop, enhancing code readability.
- **``Return Value``**: Unlike default behavior, if you don't reassign the result back to df, the original DataFrame remains unchanged. Thus, it's common to assign it to a new variable or back to df, like so: df = df.drop(columns=["new1", "new2"]).

<hr>

**The following statement removes the columns labeled 'new1' and 'new2' from the Pandas DataFrame and modifies the DataFrame in place.**
- This means that the original DataFrame will be updated without needing to reassign it.

In [81]:
df

          W         X         Y         Z      new1  new2
A  2.706850  0.628133  0.907969  0.503826  0.570325     0
B  0.651118 -0.319318 -0.848077  0.605965  0.270806     1
C -2.018168  0.740122  0.528813 -0.589001  0.391387     2
D  0.188695 -0.758872 -0.933237  0.955057  0.708208     3
E  0.190794  1.978757  2.605967  0.683509  5.156577     4

In [82]:
# It will NOT be permanent (inplace=True), unless specified!

# Drop the columns 'new1' and 'new2' in place
df.drop(["new1", "new2"], axis=1, inplace=True)

# Display the modified DataFrame after dropping the columns
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

- **``df.drop(["new1", "new2"], axis=1, inplace=True)``**: This command removes the specified columns from the DataFrame.
  - **``The axis=1``** parameter indicates that you are dropping columns.
- **``The inplace=True``** parameter means that the operation modifies the original DataFrame directly, without the need for reassignment.

<hr>

## <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Removing Rows</p>

<a id="6"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

In [85]:
# Drop the row with index 'C'

df.drop('C', axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

- **``df.drop('C', axis=0)``**: This command removes the row with the index label 'C' from the DataFrame.
  - **``The axis=0``** parameter indicates that you are dropping a row.
- **``Return Value``**: By default, drop() returns a new DataFrame with the specified row removed. If you want to modify the original DataFrame in place, we can use the inplace=True parameter, like so: df.drop('C', axis=0, inplace=True).

<hr>

In [86]:
# Drop the row with index 'B'

df.drop(index=['B'])

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

- **``df.drop(index=['B'])``**: This command removes the row with the index label 'B' from the DataFrame.
  - The **``index``** parameter is used to specify which rows to drop, making it clear and readable.
- **``Return Value``**: By default, drop() returns a new DataFrame with the specified row removed. If you want to modify the original DataFrame in place, you can use the inplace=True parameter, like so: df.drop(index=['B'], inplace=True).

<hr>

In [87]:
# the default value of axis is 0 (axis = 0)

# Drop the row with index 'C' and assign to df_temp
df_temp = df.drop('C', axis=0)

# Display the new DataFrame df_temp after dropping the row
df_temp

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

- **``df.drop('C', axis=0)``**: This command removes the row with the index label 'C' from the DataFrame.
  - **``The axis=0``** parameter specifies that the operation pertains to rows.
- **``New DataFrame``**: The result is assigned to df_temp, which contains all rows from df except for the row labeled 'C'.
- **``Original DataFrame Unchanged``**: The original DataFrame df remains unchanged, demonstrating the non-destructive nature of the drop() method by default.

<hr>

In [88]:
# Display the original DataFrame to show it remains unchanged

df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

## <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Selecting Rows and Columns using .loc[ ] and iloc[ ]</p>

<a id="7"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

#### `.loc[]` ‚Üí allows us to select data using ``labels`` (names) of rows (index) & columns

<img src=https://i.ibb.co/GJwS9gJ/pandas-loc-syntax-explanation.png width="400" height="200">

[How to use Pandas loc to subset Python dataframes](https://www.sharpsightlabs.com/blog/pandas-loc/)

#### `.iloc[]` ‚Üí allows us to select data using ``index numbers`` of rows (index) & columns. it's like classical indexing logic

<img src=https://i.ibb.co/GM9rKj4/pandas-iloc-syntax.png width="400" height="200">

[How to use Pandas iloc to subset Python data](https://www.sharpsightlabs.com/blog/pandas-iloc/)

[Source](https://towardsdatascience.com/the-illustrated-loc-and-iloc-affair-75b3f378aaf0)

In [89]:
# Generate random integer data
data = np.random.randint(1, 40, size=(8, 4))

# Create the DataFrame
df = pd.DataFrame(data, columns = ["var1", "var2", "var3", 'var4'])

# Display the DataFrame
df

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

- **``Generate Random Data:``**
  - **``np.random.randint(1, 40, size=(8, 4))``** generates an 8x4 array of random integers between 1 and 39 (inclusive of 1 and exclusive of 40).
- **``Create DataFrame:``**
  - **``pd.DataFrame(data, columns=["var1", "var2", "var3", "var4"])``** creates a Pandas DataFrame from the generated data, assigning the specified column names.

<hr>

**The following statement retrieves the row at index label 4 from the Pandas DataFrame.**
- This is useful for accessing specific rows based on their index labels.

In [90]:
# Display the DataFrame
display(df)

# Retrieve the row with index label 4
df.loc[4]

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

var1    20
var2    36
var3    31
var4    11
Name: 4, dtype: int32

- **``df.loc[4]``**: This retrieves the row where the index label is 4. The result is a Pandas Series containing the values for each column in that row.
- **``Output``**: The output displays the values for var1, var2, var3, and var4 corresponding to the row with index 4.

<hr>

In [91]:
# Display the DataFrame
display(df)

# Retrieve the row with index label 4 as a DataFrame
df.loc[[4]]

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

   var1  var2  var3  var4
4    20    36    31    11

- **``df.loc[[4]]``**: This retrieves the row with the index label 4, but by using double brackets, it returns the result as a DataFrame instead of a Series.
  - The output will have the same structure as the original DataFrame, including the column names and index.
- **``Output``**: The output displays the values for var1, var2, var3, and var4 for the specified row, with the row index preserved.

<hr>

**The following statement retrieves all rows from the Pandas DataFrame df with index labels from 2 to 5, inclusive.**
- This is useful for selecting a range of rows based on their index labels.

In [92]:
# Slicing produces the same type of the data. Here, DataFrame

# Display the DataFrame
display(df)

# Retrieve rows with index labels from 2 to 5
df.loc[2:5]

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

   var1  var2  var3  var4
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23

- **``df.loc[2:5]``**: This command selects all rows from index 2 to index 5, inclusive. This means the output will include rows with index labels 2, 3, 4, and 5.
- **``Output``**: The returned DataFrame will contain the specified rows with all their respective columns.

<hr>

**The following statement retrieves all rows from the Pandas DataFrame using integer-based indexing, specifically the rows at index positions 2, 3, and 4.**
- The slicing with **``iloc``** is **``exclusive of the endpoint``**, meaning it **``includes the start index``** but **``excludes the end index``**.

In [93]:
# Display the DataFrame
display(df)

# Retrieve rows at index positions from 2 to 4 (5 is exclusive)
df.iloc[2:5]

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

   var1  var2  var3  var4
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11

- **``df.iloc[2:5]``**: This command selects rows based on their integer index positions. In this case, it includes rows at positions 2, 3, and 4, while excluding position 5.
- **``Output``**: The returned DataFrame will contain the specified rows with all their respective columns.

<hr>

In [94]:
# Set new index labels
df.index = 'a b c d e f g h'.split()

# Display the DataFrame with the new index
df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

- **``Setting the Index``**: The command df.index = 'a b c d e f g h'.split() changes the DataFrame's index from its default integer index to a custom index defined by the letters a through h. The split() method creates a list from the string, breaking it at spaces.
- **``Output``**: The DataFrame is displayed with the newly assigned index labels, which can help make the DataFrame easier to read and interpret.

<hr>

**The following statement retrieves rows from the Pandas DataFrame df using integer-based indexing.**
- It selects rows at index positions 1, 2, and 3, while excluding the row at index position 4.

In [95]:
# Display the DataFrame
display(df)

# Retrieve rows at index positions from 1 to 3 (4 is exclusive)
df.iloc[1:4]

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

   var1  var2  var3  var4
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37

- **``df.iloc[1:4]``**: This command selects rows based on their integer index positions. It includes rows at positions 1, 2, and 3, while excluding position 4.
- **``Output``**: The returned DataFrame contains the specified rows, along with all their respective columns.

<hr>

**The following statement may give an error or unexpected results due to the way ``loc`` works in Pandas.**
- Unlike **``iloc``**, which uses **``integer-based indexing``**, **``loc``** uses **``label-based indexing``**. This means that **``loc``** will look for the index labels 1 through 4, NOT the integer positions.

In [97]:
# df.loc[1:4]  # gives error

- **``Explanation:``**
  - If the DataFrame's index is not set to integers, using df.loc[1:4] will not work as intended. Instead, it will try to retrieve rows with index labels 1, 2, 3, and 4. If those labels do not exist (for example, if the index is set to letters like 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'), it will raise a KeyError.

- **``Correct Usage:``**
  - To select a range of rows using loc, you need to ensure that the index labels exist. If you want to select rows based on their integer positions, you should use iloc.

<hr>

**The following statement retrieves all rows from the DataFrame with index labels from 'c' to 'g', inclusive.** 
- This is a powerful feature of the **``loc``** indexer in Pandas, allowing you to select a range of **``rows based on label names``**.

In [98]:
# Display the DataFrame
display(df)

# Retrieve rows with index labels from 'c' to 'g'
df.loc['c':'g']

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

   var1  var2  var3  var4
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23

- **``df.loc['c':'g']``**: This command selects all rows with index labels from 'c' to 'g', inclusive. It includes both endpoints in the result.
- **``Output``**: The returned DataFrame will contain the specified rows along with all their respective columns.

<hr>

**The following statement retrieves the ``value`` from the DataFrame ``at the intersection`` of the ``row with index label 'd'`` and the ``column labeled 'var3'``.**
- This is a straightforward way to access a specific cell in a DataFrame.

In [99]:
# Display the DataFrame
display(df)

# Retrieve the value from row 'd' and column 'var3'
df.loc['d'             ,                    'var3']

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

25

- **``df.loc['d', 'var3']``**: This command accesses the value located at the intersection of the row with index label 'd' and the column labeled 'var3'.
- **``Output``**: The returned value is the specific data from that cell, which in this example is 21.

<hr>

**The following statement retrieves the value from the DataFrame at the intersection of the ``row at index position 3`` and the ``column at index position 2``.**
- This is done using **``integer-based indexing``**, where the **``first number``** represents the **``row index``** and the **``second number``** represents the **``column index``**.

In [100]:
# Display the DataFrame
display(df)

# Retrieve the value from row position 3 and column position 2
df.iloc[3              ,             2]

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

25

- **``df.iloc[3, 2]``**: This command accesses the value located at the intersection of the row at index position 3 and the column at index position 2.
  - In this example, the row at index position 3 corresponds to the fourth row of the DataFrame, and the column at index position 2 corresponds to the third column (var3).
- **``Output``**: The returned value is the specific data from that cell, which in this example is 21.

<hr>

**The following statement retrieves the values from the DataFrame for the ``column labeled 'var2'``, specifically for the ``rows with index labels from 'd' to 'g', inclusive``.**
- This allows us to extract a **``specific column``** over a range of **``rows based on their labels``**.

In [102]:
# Display the DataFrame
display(df)

# Retrieve values from column 'var2' for rows 'd' to 'g'
df.loc['d':'g'      ,          'var2']

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

d    30
e    36
f    28
g    24
Name: var2, dtype: int32

- **``df.loc['d':'g', 'var2']``**: This command selects the values from the column 'var2' for the specified row index labels from 'd' to 'g', inclusive.
- **``Output``**: The returned result is a Pandas Series containing the values from the 'var2' column for the specified rows.

<hr>

**The following statement retrieves values from the DataFrame for the ``column labeled 'var3'``, specifically for the ``rows with index labels from 'd' to 'g', inclusive``.**
- This approach uses **``chained indexing``**, which can be less efficient but is still valid.

In [103]:
# Display the DataFrame
display(df)

# Retrieve values from column 'var3' for rows 'd' to 'g'
df.loc['d':'g']                ['var3']

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

d    25
e    31
f     9
g    38
Name: var3, dtype: int32

- **``df.loc['d':'g']['var3']:``**
  - The first part, df.loc['d':'g'], selects all rows from index 'd' to 'g', inclusive.
  - The second part, ['var3'], selects the column 'var3' from the resulting DataFrame.
- **``Output``**: The result is a Pandas Series containing the values from the 'var3' column for the specified rows.

<hr>

#### The Output as a DataFrame:The First way

**The following statement retrieves the values from the DataFrame for the ``column labeled 'var3'``, specifically for the ``rows with index labels from 'd' to 'g', inclusive``.**
- This approach uses **``chained indexing``**, which allows us to return a **``DataFrame``** instead of a Series.

In [104]:
# how can we select these data as a DataFrame not a series

# Retrieve the 'var3' column for rows 'd' to 'g'
df.loc['d':'g']           [['var3']]

   var3
d    25
e    31
f     9
g    38

- **``df.loc['d':'g']``**: This part selects all rows from index 'd' to 'g', inclusive.
- **``[['var3']]:``** This part selects the column 'var3', returning a DataFrame instead of a Series. The double brackets are necessary to ensure the output remains a DataFrame.
- **``Output``**: The result is a DataFrame containing the values from the 'var3' column for the specified rows.

<hr>

#### The Output as a DataFrame: The Second way

**The following statement retrieves the values from the DataFrame for the ``column labeled 'var3'``, specifically for the ``rows with index labels from 'd' to 'g', inclusive``.**
- This method allows us to **``select a specific column``** while also specifying a **``range of rows based on their labels``**.

In [107]:
# Second way

# Retrieve the 'var3' column for rows 'd' to 'g'
df.loc['d':'g'          ,              ["var3"]]

   var3
d    25
e    31
f     9
g    38

- **``df.loc['d':'g', ["var3"]]:``**
  - The first part, df.loc['d':'g'], selects all rows from index 'd' to 'g', inclusive.
  - The second part, ["var3"], specifies that you want to retrieve only the 'var3' column. The double brackets ensure that the output remains a DataFrame.
- **``Output``**: The result is a DataFrame that contains the values from the 'var3' column for the specified rows.

<hr>

**The following statement retrieves the values from the DataFrame for the ``columns labeled 'var2' and 'var3'``, specifically for the ``rows with index labels from 'd' to 'g', inclusive``.**
- This method uses **``chained indexing``**, which can return the **``specified columns``** while filtering by the **``specified row range``**.

In [110]:
# Display the DataFrame
display(df)

# Retrieve the 'var2' and 'var3' columns for rows 'd' to 'g'
df.loc['d':'g']            [["var2",  "var3"]]

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

   var2  var3
d    30    25
e    36    31
f    28     9
g    24    38

- **``df.loc['d':'g']``**: This part selects all rows from index 'd' to 'g', inclusive.
- **``[["var2", "var3"]]``**: This part specifies that you want to retrieve the columns 'var2' and 'var3'. The double brackets ensure that the result remains a DataFrame.
- **``Output``**: The result is a DataFrame containing the values from the 'var2' and 'var3' columns for the specified rows.

<hr>

**The following statement retrieves the values from the DataFrame for the ``rows at index positions 2, 3, and 4``, specifically from the ``column at index position 2``.**
- This is done using **``integer-based indexing``**.

In [112]:
# Display the DataFrame
display(df)

# Retrieve values from rows 2 to 4 (5 is exclusive) and column at index position 2
df.iloc[2:5,       2]

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

c    12
d    25
e    31
Name: var3, dtype: int32

- **``df.iloc[2:5, 2]:``**
  - The first part (2:5) specifies the row positions to retrieve, which includes rows at index positions 2, 3, and 4 (note that 5 is exclusive).
  - The second part (2) specifies the column index to retrieve, which corresponds to the third column (var3 in this case).
- **``Output``**: The result is a Pandas Series containing the values from the specified rows for the selected column.

<hr>

**The following statement retrieves the values from the DataFrame for the ``rows at index positions 2, 3, and 4``, specifically from the ``column at index position 2``.**
- Unlike **``df.iloc[2:5, 2]``**, which returns a Series, this approach **``returns a DataFrame``** because of the use of **``double brackets``**.

In [113]:
# Display the DataFrame
display(df)

# Retrieve values from rows 2 to 4 (5 is exclusive) for column at index position 2
df.iloc[2:5, [2]]

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

   var3
c    12
d    25
e    31

- **``df.iloc[2:5, [2]]:``**
  - The first part (2:5) specifies the row positions to retrieve, which includes rows at index positions 2, 3, and 4 (with 5 being exclusive).
  - The second part ([2]) specifies the column index as a list, which means you are selecting the third column (corresponding to var3).
- **``Output``**: The result is a DataFrame containing the values from the specified rows for the selected column.

<hr>

**The following statement ``raises an error`` because of how chained indexing works in Pandas.**

In [ ]:
# df.iloc[2:5]                [[2]]  # gives error

# df.iloc[2:5, [2]]  # this approach works

- **``Explanation of the Error:``**
  - **``First Part (df.iloc[2:5]):``**
    - This part correctly selects rows at index positions 2, 3, and 4 from the DataFrame df. The result is a DataFrame containing those rows.
- **``Second Part ([[2]]):``**
  - When you apply [[2]] on the resulting DataFrame, Pandas interprets this as an attempt to select columns by their labels, but [2] is NOT a valid column label. Instead, it needs to be in the form of a list of column names (e.g., ["var3"]).
<hr>

- **``Correct Ways to Achieve the Desired Outcome:``**
  - If you want to select a specific column by its index after filtering rows, you can do it using one of the following approaches:

- **``1. Using iloc with Column Index``**
Correct way to select the column by index after filtering rows
values = df.iloc[2:5, [2]]  # This will work and return a DataFrame
- **``2. Using iloc with a Label``**
  - If you want to select by column label instead of index, you can do it like this:
    - Select the rows first and then the column by name
    - values = df.iloc[2:5][["var3"]]  # This will work and return a DataFrame


**``Summary``**
- The **``reason we encounter an error``** with df.iloc[2:5][[2]] is that the **``second part is trying to use an integer index to filter columns``**, which is NOT a valid operation in that context. 
  - We should either specify the column by its index in the first iloc call or 
  - ensure that the second part uses valid column labels.

<hr>

**The following statement retrieves the values from the DataFrame for the ``rows at index positions 2, 3, and 4``, specifically from the ``column labeled 'var3'``.**
- This approach uses **``chained indexing``**, which is valid but can be less efficient.

In [114]:
# Display the DataFrame
display(df)

# Retrieve the 'var3' column for rows 2 to 4
df.iloc[2:5][['var3']]

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

   var3
c    12
d    25
e    31

- **``df.iloc[2:5]``**: This part selects rows at index positions 2, 3, and 4 (the 5 is exclusive).
- **``[['var3']]``**: This part specifies that you want to retrieve the column labeled 'var3'. The double brackets ensure that the output remains a DataFrame.

<hr>

<hr>

**The following statement retrieves the value from the DataFrame at the intersection of the ``row with index label 'a'`` and the ``column labeled 'var1'``.**
- This is done using **``label-based indexing``**.

In [115]:
# Display the DataFrame
display(df)

# Retrieve the value from row 'a' and column 'var1'
df.loc['a', 'var1']

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

8

- **``df.loc['a', 'var1']``**: This command accesses the value located at the intersection of the row with index label 'a' and the column labeled 'var1'.
- **``Output``**: The returned value is the specific data from that cell, which in this case is 15.

<hr>

**The following statement retrieves the values from the DataFrame for the ``row with index label 'a'`` and the ``column labeled 'var1'``.**
- This approach uses **``double brackets``**, which ensures that the **``output``** remains a **``DataFrame``**.

In [116]:
# let's select the same data as a DataFrame

# Retrieve the value from row 'a' and column 'var1' as a DataFrame
df.loc[['a'], ['var1']]

   var1
a     8

- **``df.loc[['a'], ['var1']]:``**
  - The first part ([['a']]) specifies the row(s) you want to select, which in this case is the row labeled 'a'.
  - The second part ([['var1']]) specifies the column(s) you want, ensuring that the output remains a DataFrame.
- **``Output``**: The result is a DataFrame containing the value from the specified row and column.

<hr>

**The following statement retrieves the values from the DataFrame for the ``rows with index labels 'a' and 'c'``, specifically for the ``columns labeled 'var1' and 'var3'``.**
- This method allows you to extract **``specific subsets of data``** efficiently.

In [117]:
# Display the DataFrame
display(df)

# Retrieve values from rows 'a' and 'c' for columns 'var1' and 'var3'
df.loc[['a', 'c'], ['var1', 'var3']]

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

   var1  var3
a     8    39
c    13    12

- **``df.loc[['a', 'c'], ['var1', 'var3']]:``**
  - The first part ([['a', 'c']]) specifies the rows you want to select, which are labeled 'a' and 'c'.
  - The second part ([['var1', 'var3']]) specifies the columns you want to retrieve, which are 'var1' and 'var3'.
- **``Output``**: The result is a DataFrame containing the values from the specified rows and columns.

<hr>

**The following statement retrieves values from the DataFrame for the ``specified rows and columns`` using ``integer-based indexing``.** 
- Specifically, it selects the **``values``** at the **``first and third rows``** (index positions 0 and 2) and the **``first and third columns``** (index positions 0 and 2).

In [118]:
# Display the DataFrame
display(df)

# Retrieve values from rows 0 and 2 for columns 0 and 2
df.iloc[[0, 2], [0, 2]]

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

   var1  var3
a     8    39
c    13    12

- **``df.iloc[[0, 2], [0, 2]]:``**
  - The **``first part ([0, 2])``** specifies that we want to select **``rows at index positions 0 and 2``**.
  - The **``second part ([0, 2])``** specifies that we want to select **``columns at index positions 0 and 2``**.
- **``Output``**: The result is a DataFrame containing the values from the specified rows and columns.

<hr>

## <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Conditional Selection</p>

<a id="8"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [119]:
# Let's remember our DataFrame

df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

### <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">One Conditional Statement</p>

<a id="8.1"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**The following expression creates a boolean DataFrame where each element is evaluated to ``True`` if the ``corresponding element`` in the DataFrame is ``greater than 10``, and ``False otherwise``.**
- This operation is useful for filtering or performing conditional checks within the DataFrame.

In [120]:
# returns a DataFrame consists of bool type

# Create a boolean DataFrame where each element is True if greater than 10
df > 10

    var1   var2   var3   var4
a  False   True   True  False
b   True  False   True  False
c   True   True   True   True
d   True   True   True   True
e   True   True   True   True
f   True   True  False   True
g   True   True   True   True
h  False  False   True   True

- **``df > 10:``**
  - This operation compares each element of the DataFrame with 10.
  - The result is a new DataFrame of the same shape as df, filled with boolean values (True or False).

<hr>

**The following expression creates a new DataFrame where each element is ``replaced by its original value`` if it is ``greater than 10``, and ``NaN (Not a Number) if it is NOT``.**
- This operation is useful for filtering out values based on a condition while retaining the original DataFrame's structure.

In [121]:
# Create a new DataFrame with values greater than 10, others as NaN

df[df > 10]

   var1  var2  var3  var4
a   NaN  11.0  39.0   NaN
b  19.0   NaN  16.0   NaN
c  13.0  18.0  12.0  16.0
d  34.0  30.0  25.0  37.0
e  20.0  36.0  31.0  11.0
f  21.0  28.0   NaN  23.0
g  27.0  24.0  38.0  23.0
h   NaN   NaN  19.0  29.0

- **``df[df > 10]:``**
  - This line creates a boolean mask where each element is checked against 10.
  - In the resulting DataFrame, elements greater than 10 retain their values, while those less than or equal to 10 are replaced with NaN.

<hr>

**The following expression filters the DataFrame to return ``only the rows`` where the ``values`` in ``the column 'var1'`` are ``greater than 10``.**
- This operation allows us to **``subset our DataFrame``** **``based on a condition``** applied to a **``specific column``**.

In [122]:
# It returns based on rows.

# Filter the DataFrame to include only rows where 'var1' > 10
df[          df['var1'] > 10              ]

   var1  var2  var3  var4
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23

- **``df['var1'] > 10:``**
  - This part creates a boolean Series where each element is True if the corresponding value in the 'var1' column is greater than 10 and False otherwise.
- **``df[df['var1'] > 10]:``**
  - This filters the original DataFrame df, returning only the rows where the condition is True.

<hr>

**The following expression filters the DataFrame to return the ``values in the 'var2' column`` for those ``rows where the values in the 'var1' column are greater than 10``.**
- This operation combines **``filtering``** and **``selection``** of a specific column.

In [123]:
# Filter the DataFrame to include only rows where 'var1' > 10 and select 'var2'

df[df['var1'] > 10]               ['var2']

b     8
c    18
d    30
e    36
f    28
g    24
Name: var2, dtype: int32

- **``df['var1'] > 10:``**
  - This creates a boolean Series where each element is True if the corresponding value in the 'var1' column is greater than 10.
- **``df[df['var1'] > 10]:``**
  - This filters the original DataFrame to return only the rows that meet the condition.
- **``['var2']:``**
  - This selects the 'var2' column from the filtered DataFrame, resulting in a Series of values from that column.

<hr>

**The following expression filters the DataFrame to return a ``new DataFrame`` containing ``only the rows`` where the ``values in the 'var1' column are greater than 10``, specifically ``selecting the 'var2' column``.**
- This operation allows us to **``filter``** data and maintain the **``DataFrame format``**.

In [124]:
# Filter the DataFrame to include only rows where 'var1' > 10 and select 'var2' as a DataFrame

df[df['var1'] > 10]          [['var2']]

   var2
b     8
c    18
d    30
e    36
f    28
g    24

- **``df['var1'] > 10:``**
  - This creates a boolean Series indicating which rows in the 'var1' column are greater than 10.
- **``df[df['var1'] > 10]:``**
  - This filters the original DataFrame, returning only the rows where the condition is True.
- **``[['var2']]:``**
  - This selects the 'var2' column from the filtered DataFrame and ensures that the output remains a DataFrame.

<hr>

**The following expression filters the DataFrame to return a ``new DataFrame`` containing ``only the rows`` where the ``values in the 'var1' column are greater than 10``, specifically ``selecting the columns 'var2' and 'var3'``.**
- This operation allows us to **``filter our data``** and **``retrieve specific columns``** in a **``structured, DataFrame format``**.

In [125]:
# how can we select the data as a DataFrame

# Filter the DataFrame to include only rows where 'var1' > 10 and select 'var2' and 'var3'
df[df['var1'] > 10]               [['var2', "var3"]]

   var2  var3
b     8    16
c    18    12
d    30    25
e    36    31
f    28     9
g    24    38

- **``df['var1'] > 10:``**
  - This creates a boolean Series indicating which rows in the 'var1' column are greater than 10.
- **``df[df['var1'] > 10]:``**
  - This filters the original DataFrame to return only the rows where the condition is True.
- **``[['var2', 'var3']]:``**
  - This selects the columns 'var2' and 'var3' from the filtered DataFrame.

<hr>

### <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Two or More Conditional Statements</p>

<a id="8.2"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

**For two or more conditions, you can use | ‚Üí or, & ‚Üí and with parenthesis:**

In [126]:
# Let's remember our DataFrame

df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

<hr>

**The following expression filters the DataFrame to return ``only the rows`` where the ``values in the 'var1' column are greater than 10 and less than 20``.**
- This operation allows for **``more complex conditions``** using **``logical operators``**.

In [127]:
# Filter the DataFrame to include only rows where 'var1' > 10 and < 20

df[(df['var1'] > 10) & (df['var1'] < 20)]

   var1  var2  var3  var4
b    19     8    16     1
c    13    18    12    16

- **``df['var1'] > 10:``**
  - This creates a boolean Series indicating which rows in the 'var1' column are greater than 10.
- **``df['var1'] < 20:``**
  - This creates another boolean Series indicating which rows in the 'var1' column are less than 20.
- **``&:``**
  - This logical operator combines the two boolean Series to check for rows that satisfy both conditions.
- **``df[(df['var1'] > 10) & (df['var1'] < 20)]:``**
  - This filters the original DataFrame, returning only the rows where both conditions are True.

<hr>

### <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:150%; text-align:LEFT; border-radius:10px 10px;">Conditional Selection Using .loc[ ] and .iloc[ ]</p>

<a id="8.3"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>
<hr>

**The following expression filters the DataFrame to return only the rows where the values in the 'var1' column are greater than 10, specifically selecting the columns 'var2' and 'var3'.**
- This approach uses label-based indexing with conditions.

In [129]:
df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [128]:
# Filter the DataFrame to include only rows where 'var1' > 10 and select 'var2' and 'var3'

df.loc[(df["var1"] > 10)               ,           ['var2', 'var3']]

   var2  var3
b     8    16
c    18    12
d    30    25
e    36    31
f    28     9
g    24    38

- **``df["var1"] > 10:``**
  - This creates a boolean Series indicating which rows in the 'var1' column are greater than 10.
- **``df.loc[...]:``**
  - The loc method is used to access a group of rows and columns by labels or a boolean array.
- **``['var2', 'var3']:``**
  - This specifies that you want to select the columns 'var2' and 'var3' from the filtered DataFrame.

<hr>

**The following expression filters the DataFrame to return ``only the rows`` where the ``values in the 'var1' column are either less than 10 or greater than 30``.**
- It specifically selects the columns **``'var2' and 'var3'``**. This allows for filtering based on **``multiple conditions``** using the **``logical OR operator (|)``**.

In [131]:
df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [130]:
# Filter the DataFrame to include rows where 'var1' < 10 or > 30 and select 'var2' and 'var3'

df.loc[((df["var1"] < 10) | (df["var1"] > 30))         ,              ['var2', 'var3']]

   var2  var3
a    11    39
d    30    25

- **``(df["var1"] < 10):``**
  - This creates a boolean Series indicating which rows in the 'var1' column are less than 10.
- **``(df["var1"] > 30):``**
  - This creates another boolean Series indicating which rows in the 'var1' column are greater than 30.
- **``|``**:
  - This logical operator combines the two boolean Series to check for rows that satisfy either condition.
- **``df.loc[...]:``**
  - The loc method is used to select rows and columns by labels or a boolean array.
- **``['var2', 'var3']:``**
  - This specifies that you want to select the columns 'var2' and 'var3' from the filtered DataFrame.

<hr>

## <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">reset_index() & set_index()</p>

<a id="9"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!

In [132]:
# Let's remember our DataFrame

df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

<hr>

**The following method is used to ``reset the index ``of a DataFrame back to the default integer index (0, 1, 2, ‚Ä¶).**
- This method is particularly useful when we want to **``remove the current index``** and **``replace it with a new default index``**, while **``optionally retaining the old index as a column``**.

In [133]:
# Reset to default 0, 1...n index

df.reset_index()

  index  var1  var2  var3  var4
0     a     8    11    39    10
1     b    19     8    16     1
2     c    13    18    12    16
3     d    34    30    25    37
4     e    20    36    31    11
5     f    21    28     9    23
6     g    27    24    38    23
7     h    10     3    19    29

- **``Original DataFrame:``** The DataFrame has a custom index with labels 'a', 'b', 'c', etc.
  - **``df.reset_index()``**:
    - This method resets the index of the DataFrame. The old index will be added as a new column named 'index'.
  - **``Resulting DataFrame``**: The new DataFrame has a default integer index, and the original index labels are preserved in a new column.

- **``Options:``**
  - **``drop=True``**: If you don't want to keep the old index as a column, you can use df.reset_index(drop=True). This will simply discard the old index without creating a new column.

<hr>

**The following method is used to ``reset the index`` of a DataFrame and ``replace it with the default integer index (0, 1, 2, ...)``, while ``discarding the existing index entirely``.**
- This is particularly useful when we want to **``remove the current index without retaining it as a column``** in the DataFrame.

In [134]:
# Reset the index and drop the old index

df.reset_index(drop=True)

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

- **``Original DataFrame``**: This DataFrame has a custom index with labels 'a', 'b', 'c', etc.
  - **``df.reset_index(drop=True)``**:
    - This method resets the index of the DataFrame.
    - The argument drop=True indicates that the old index should be discarded and not added as a new column in the DataFrame.
- **``Resulting DataFrame``**: The new DataFrame has a default integer index, and the old index is not retained.

<hr>

**The following expression modifies the existing DataFrame by ``resetting its index to the default integer index (0, 1, 2, ...)``, while ``discarding the current index without adding it as a column``.**
- The **``inplace=True``** argument means that the **``operation will be performed directly on the original DataFrame``**, and NO new DataFrame will be created.

In [135]:
df

   var1  var2  var3  var4
a     8    11    39    10
b    19     8    16     1
c    13    18    12    16
d    34    30    25    37
e    20    36    31    11
f    21    28     9    23
g    27    24    38    23
h    10     3    19    29

In [136]:
# Reset the index in place and drop the old index
df.reset_index(drop=True, inplace=True)

# Display the DataFrame after resetting the index
df

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

- **``Original DataFrame``**: The DataFrame has a custom index with labels 'a', 'b', 'c', etc.
  - **``df.reset_index(drop=True, inplace=True):``**
    - This method resets the index of the DataFrame.
    - The **``drop=True``** argument indicates that the old index should be discarded, not added as a new column.
    - The **``inplace=True``** argument modifies the original DataFrame df directly, so there is no need to assign it to a new variable.
  - **``Resulting DataFrame``**: The original DataFrame now has a default integer index, and the old index is removed.

<hr>

**The following expression ``sets the column 'var4' as the index`` of the DataFrame.**
- This operation changes the structure of the DataFrame so that the **``specified column becomes the new index``**, allowing for more intuitive access and manipulation based on that column. 
  - **``By default``**, this method **``returns a new DataFrame``**.

In [137]:
# Set 'var4' as the index

df.set_index('var4')

      var1  var2  var3
var4
10       8    11    39
1       19     8    16
16      13    18    12
37      34    30    25
11      20    36    31
23      21    28     9
23      27    24    38
29      10     3    19

- **``Original DataFrame``**: This DataFrame has columns 'var1', 'var2', 'var3', and 'var4'.
  - **``df.set_index('var4'):``**
    - This method sets the column 'var4' as the new index of the DataFrame.
    - The result is a new DataFrame where the values in the 'var4' column are used as the index.
  - **``Resulting DataFrame``**: The original DataFrame remains unchanged unless you specify inplace=True. The new DataFrame displays the values of 'var4' as the index.

<hr>

**The following expression ``sets the column 'var4' as the index`` of the DataFrame and modifies the original DataFrame directly.**
- This means that the **``values from the 'var4' column will replace the default integer index``**, and the operation will NOT return a new DataFrame.

  - This method **``modifies the original DataFrame if specified with inplace=True``**.

In [138]:
df

   var1  var2  var3  var4
0     8    11    39    10
1    19     8    16     1
2    13    18    12    16
3    34    30    25    37
4    20    36    31    11
5    21    28     9    23
6    27    24    38    23
7    10     3    19    29

In [139]:
# Set 'var4' as the index and modify df in place
df.set_index('var4', inplace=True)

# Display the DataFrame after setting 'var4' as the index
df

      var1  var2  var3
var4
10       8    11    39
1       19     8    16
16      13    18    12
37      34    30    25
11      20    36    31
23      21    28     9
23      27    24    38
29      10     3    19

- **``Original DataFrame``**: The DataFrame has columns 'var1', 'var2', 'var3', and 'var4'.
  - **``df.set_index('var4', inplace=True):``**
    - This method sets the column 'var4' as the new index of the DataFrame.
    - **``The inplace=True``** argument indicates that the operation modifies the original DataFrame directly, so there is no need to assign it to a new variable.
  - **``Resulting DataFrame``**: The column 'var4' values now serve as the index of the DataFrame, and the original integer index is removed.

<hr>

## <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Multi-Index & Index Hierarchy</p>

<a id="10"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

<img src=https://i.ibb.co/80rJKHK/multi-index.png width="400" height="200">

[Source](https://pynative.com/pandas-reset-index/)

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

**The following two lists, ``outside`` and ``inside``, will be used to create the index levels of a MultiIndex.**

In [140]:
# Define two lists of "outside" and "inside" used for "index levels" in a MultiIndex
outside = ['M1', 'M1', 'M1', 'M2', 'M2', 'M2', 'M3', 'M3', 'M3']
inside = [1, 2, 3, 1, 2, 3, 5, 6, 7]

# Create a MultiIndex from the outside and inside lists
multi_index = list(zip(outside, inside))

# Display the MultiIndex
multi_index

[('M1', 1),
 ('M1', 2),
 ('M1', 3),
 ('M2', 1),
 ('M2', 2),
 ('M2', 3),
 ('M3', 5),
 ('M3', 6),
 ('M3', 7)]

- **``Creating MultiIndex:``**
  - The zip function combines the outside and inside lists into tuples.
  - pd.MultiIndex.from_tuples creates a MultiIndex from these tuples.
<hr>

- **``Benefits of MultiIndex:``**
  - **``Hierarchical Data Representation``**: Useful for representing data with multiple dimensions.
  - **``Improved Data Manipulation``**: You can easily slice and manipulate data based on multiple index levels.
  - **``Enhanced Grouping``**: Facilitates group operations on different levels of the index.

<hr>

**The following expression creates a MultiIndex from a list of tuples.** 
- This can be useful for organizing data hierarchically in a pandas DataFrame, enabling us to represent and manipulate multi-dimensional data more effectively and easier access to nested data structures.

In [141]:
# Create a MultiIndex from the list of tuples
hier_index = pd.MultiIndex.from_tuples(multi_index)

# Display the MultiIndex
print("Hierarchical Index (MultiIndex):")
hier_index

Hierarchical Index (MultiIndex):

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3),
            ('M3', 5),
            ('M3', 6),
            ('M3', 7)],
           )

- **``Creating the List of Tuples:``**
  - **``zip(outside, inside)``** combines the two lists into a list of tuples, where each tuple corresponds to a unique combination of the two lists.
- **``Creating MultiIndex:``**
  - **``pd.MultiIndex.from_tuples(multi_index)``** creates a MultiIndex from the list of tuples, allowing you to index data hierarchically.
- **``Using MultiIndex in a DataFrame:``**
  - A DataFrame is created with the MultiIndex as the index, containing some sample data in the 'value' column.

<hr>

**Using ``np.random.seed(101)`` ensures that the ``random numbers`` generated by NumPy are the ``same each time the code is run``, which is helpful for reproducibility.**
- **The following code ``creates a DataFrame with a MultiIndex`` and four ``columns labeled 'A', 'B', 'C', and 'D'``.**

In [142]:
# Set the random seed for reproducibility
np.random.seed(101)

# Create the DataFrame with random numbers
df = pd.DataFrame(np.random.randn(9, 4), 
                  index=hier_index, 
                  columns=['A', 'B', 'C', 'D'])

# Display the DataFrame
df

             A         B         C         D
M1 1  2.706850  0.628133  0.907969  0.503826
   2  0.651118 -0.319318 -0.848077  0.605965
   3 -2.018168  0.740122  0.528813 -0.589001
M2 1  0.188695 -0.758872 -0.933237  0.955057
   2  0.190794  1.978757  2.605967  0.683509
   3  0.302665  1.693723 -1.706086 -1.159119
M3 5 -0.134841  0.390528  0.166905  0.184502
   6  0.807706  0.072960  0.638787  0.329646
   7 -0.497104 -0.754070 -0.943406  0.484752

- **``Random Seed``**: np.random.seed(101) sets the seed for the random number generator, ensuring that the random values generated are the same each time the code is executed.
- **``MultiIndex Creation``**: The MultiIndex is created using pd.MultiIndex.from_tuples(multi_index), which combines the outside and inside lists into a hierarchical index.
- **``DataFrame Creation``**: The DataFrame df is created with 9 rows and 4 columns, populated with random numbers generated by np.random.randn(9, 4).
- **``DataFrame Display``**: The DataFrame is printed, showing the hierarchical index along with the random values in each of the four specified columns.

<hr>

**The ``index.names`` attribute in a pandas DataFrame returns the ``names of the index levels``.**
- If a MultiIndex is used, it will return a list of the names for each level of the index.

In [143]:
# Get the names of the index levels

df.index.names

FrozenList([None, None])

- **``MultiIndex Creation``**: When creating the MultiIndex, we specify names for each index level using the names parameter. In this case, the levels are named 'Group' and 'Number'.
- **``Accessing Index Names``**: The attribute df.index.names retrieves the names of the index levels. This will return a list of the names for each level in the MultiIndex.

<p style="background-color:#FFFFFF; font-family:newtimeroman; color:#008000; font-size:125%; text-align:left;"><strong>Note that all of the MultiIndex constructors accept a names argument which stores string names for the levels themselves. If no names are provided, None will be assigned:</strong></p>

For more information Indexing and Selecting Data, visit [**Pandas Official Documentation**](https://pandas.pydata.org/pandas-docs/version/0.13.0/indexing.html)

<hr>

**We can ``set the names of the index levels`` in a DataFrame using df.index.names.**
- This allows us to **``rename the levels of a MultiIndex``**, making it clearer what each level represents.

In [144]:
# Set the index names
df.index.names = ['Group', 'Num']

# Get the updated index names
df.index.names

FrozenList(['Group', 'Num'])

- **``Setting Index Names``**: The line **``df.index.names = ['Group', 'Num']``** assigns the names **``'Group'``** and **``'Num'``** to the **```respective levels of the MultiIndex``**. This makes the DataFrame more interpretable, especially when dealing with complex datasets.
- **``Retrieving Updated Index Names``**: After setting the names, we can access them again using df.index.names, which will **``return the updated list of index names``**.

<hr>

In [145]:
# Let's check the index level names of modified DataFrame

df

                  A         B         C         D
Group Num
M1    1    2.706850  0.628133  0.907969  0.503826
      2    0.651118 -0.319318 -0.848077  0.605965
      3   -2.018168  0.740122  0.528813 -0.589001
M2    1    0.188695 -0.758872 -0.933237  0.955057
      2    0.190794  1.978757  2.605967  0.683509
      3    0.302665  1.693723 -1.706086 -1.159119
M3    5   -0.134841  0.390528  0.166905  0.184502
      6    0.807706  0.072960  0.638787  0.329646
      7   -0.497104 -0.754070 -0.943406  0.484752

<hr>

**The ``index`` attribute in a pandas DataFrame returns the ``index (or indices) of the DataFrame``.**
- If the DataFrame has a **``regular index``**, it will return a **``simple Index object``**; 
- if the DataFrame has a **``MultiIndex (hierarchical index)``**, it will return a **``MultiIndex object``**.

In [146]:
# Access the index of the DataFrame

df.index

MultiIndex([('M1', 1),
            ('M1', 2),
            ('M1', 3),
            ('M2', 1),
            ('M2', 2),
            ('M2', 3),
            ('M3', 5),
            ('M3', 6),
            ('M3', 7)],
           names=['Group', 'Num'])

- **``Accessing the Index``**: The line index = df.index retrieves the index of the DataFrame. Since df has a MultiIndex, index will be a MultiIndex object.
- **``Displaying the Index``**: Printing index shows the hierarchical structure of the index, along with the names of the levels, which in this case are 'Group' and 'Num'.

<hr>

**The ``index.levels`` attribute in a pandas DataFrame with a MultiIndex returns a ``list of the unique values at each level of the index``.**
- This attribute is particularly useful for understanding the structure of a MultiIndex and for accessing the distinct values associated with each level.

In [147]:
# Access the unique values at each level of the index
display(df.index.levels)

# Access the unique values at each level of the index
index_levels = df.index.levels
print("\nUnique values at each level of the index:")
for i, level in enumerate(index_levels):
    print(f"Level {i}: {level.tolist()}")

FrozenList([['M1', 'M2', 'M3'], [1, 2, 3, 5, 6, 7]])

Unique values at each level of the index:
Level 0: ['M1', 'M2', 'M3']
Level 1: [1, 2, 3, 5, 6, 7]

- **``Accessing Levels``**: The line index_levels = df.index.levels retrieves the unique values for each level of the MultiIndex.
- **``Displaying Unique Values``**: The loop iterates over each level in index_levels, printing the unique values at each level. The output displays the distinct values for the 'Group' and 'Num' levels.

<hr>

**The following method retrieves the ``values from a specific level of a MultiIndex``.**
- By passing the level number or level name as an argument, we can extract the corresponding index values.

In [148]:
# Get the values from the first level of the index
first_level_values = df.index.get_level_values(0)

print("\nValues from the first level of the index:")
print(first_level_values)

Values from the first level of the index:
Index(['M1', 'M1', 'M1', 'M2', 'M2', 'M2', 'M3', 'M3', 'M3'], dtype='object', name='Group')

- **``Retrieving Level Values``**: The line **``first_level_values = df.index.get_level_values(0)``** retrieves the **``values from the first level of the MultiIndex``** (which corresponds to the **``'Group'``** level).
- **``Displaying First Level Values``**: The output shows the **``values from the first level``**, which are the group names (**``'M1', 'M2', 'M3'``**) repeated according to their corresponding rows.

<hr>

**The following method retrieves the values from the specified level of a MultiIndex by using the level name.**
- This is particularly useful for **``accessing the values associated with a specific index level``** when working with hierarchical data.

In [149]:
# Get the values from the 'Group' level of the index
group_values = df.index.get_level_values("Group")

print("\nValues from the 'Group' level of the index:")
print(group_values)

Values from the 'Group' level of the index:
Index(['M1', 'M1', 'M1', 'M2', 'M2', 'M2', 'M3', 'M3', 'M3'], dtype='object', name='Group')

- **``Retrieving Group Level Values``**: The line **``group_values = df.index.get_level_values("Group")``** retrieves the **``values from the "Group" level of the MultiIndex``**.
- **``Displaying Group Values``**: The output shows the **``values from the "Group" level``**, which in this case are the group names (**``'M1', 'M2', 'M3'``**) repeated according to their corresponding rows.

<hr>

### Selection of Columns:

**The following expression selects the ``column "A"`` from the DataFrame.**
- In pandas, using **``double square brackets [[ ]]``** returns a **``DataFrame``** containing the specified column(s), whereas using a **``single bracket [ ]``** would return a **``Series``**.
  - Now let's show how to index this! For index hierarchy we generally prefer to use **``df.loc[]``**, if this was on the columns axis, we would just use normal bracket notation **``df[]``**. Calling one level of the index returns the sub-dataframe:

In [150]:
# Select the column 'A'

df[["A"]]

                  A
Group Num
M1    1    2.706850
      2    0.651118
      3   -2.018168
M2    1    0.188695
      2    0.190794
      3    0.302665
M3    5   -0.134841
      6    0.807706
      7   -0.497104

- **``Selecting Column "A"``**: The line column_a = df[["A"]] selects the column "A" from the DataFrame. The use of double brackets [[ ]] ensures that the result is a DataFrame.
- **``Displaying the Selected Column``**: The output shows only the column "A" along with the MultiIndex, maintaining the same hierarchical structure.

<hr>

**The following expression selects ``multiple columns`` from the DataFrame.**
- This method returns a **``new DataFrame``** containing **``only the specified columns``**, while maintaining the original DataFrame's structure, including any MultiIndex.

In [151]:
# Select the columns 'A' and 'B'

df[["A", "B"]]

                  A         B
Group Num
M1    1    2.706850  0.628133
      2    0.651118 -0.319318
      3   -2.018168  0.740122
M2    1    0.188695 -0.758872
      2    0.190794  1.978757
      3    0.302665  1.693723
M3    5   -0.134841  0.390528
      6    0.807706  0.072960
      7   -0.497104 -0.754070

- **``Selecting Columns "A" and "B"``**: The line selected_columns = df[["A", "B"]] selects the specified columns from the DataFrame, resulting in a new DataFrame that includes only columns "A" and "B".
- **``Displaying Selected Columns``**: The output shows the selected columns while preserving the MultiIndex structure, allowing for easy interpretation of the data.

<hr>

### Selection of Multi-Index Levels:

**The following expression select ``all rows associated with the index label 'M1'`` from a MultiIndex.**
- This is particularly useful for filtering the DataFrame based on one level of the MultiIndex.

In [152]:
# Select all rows for the group 'M1'

df.loc['M1']

            A         B         C         D
Num
1    2.706850  0.628133  0.907969  0.503826
2    0.651118 -0.319318 -0.848077  0.605965
3   -2.018168  0.740122  0.528813 -0.589001

- **``Selecting Rows for Group 'M1'``**: The line m1_rows = df.loc['M1'] retrieves all rows where the first level of the MultiIndex is 'M1'. This effectively filters the DataFrame to show only the relevant data.
- **``Displaying Selected Rows``**: The output shows the rows corresponding to group 'M1', along with their respective values in columns 'A', 'B', 'C', and 'D'. The second level of the index ('Num') is preserved.

<hr>

**The following expression selects a ``specific row`` from the DataFrame with a MultiIndex by ``specifying a tuple`` that corresponds to both levels of the index.**
- In this case, it retrieves the **``row where the first level of the index is 'M1' and the second level is 2``**.

In [153]:
# Select the specific row for group 'M1' and Num 2

df.loc[("M1", 2)]

A    0.651118
B   -0.319318
C   -0.848077
D    0.605965
Name: (M1, 2), dtype: float64

- **``Selecting a Specific Row``**: The line row_m1_2 = df.loc[("M1", 2)] retrieves the row where the first level of the index is 'M1' and the second level is 2. This allows for precise access to the data.
- **``Displaying the Selected Row``**: The output shows the values for the columns 'A', 'B', 'C', and 'D' for the specified index. The index is displayed as a tuple.

<hr>

**The following expression selects a ``specific row`` from the DataFrame with a MultiIndex.**
- The key difference here is the use of **``double brackets [[ ]]``**, which returns the result as a **``DataFrame``**, **``even when selecting a single row``**.

In [154]:
# Select the specific row for group 'M1' and Num 2 using double brackets

df.loc[[("M1", 2)]]

                  A         B         C         D
Group Num
M1    2    0.651118 -0.319318 -0.848077  0.605965

- **``Selecting a Specific Row as a DataFrame``**: The line **``row_m1_2_df = df.loc[[("M1", 2)]]``** retrieves the **``row where the first level of the index is 'M1' and the second level is 2``**. Using **``double brackets [[ ]]``** ensures that the result is returned as a **``DataFrame``**.
- **``Displaying the Selected Row``**: The output shows the selected row as a DataFrame, preserving the MultiIndex structure. This can be useful for consistency in operations that expect a DataFrame.

<hr>

**The following expression selects ``all rows`` corresponding to the ``index label "M1"`` and the ``columns from "A" to "C" (inclusive)``.**
- This is a powerful way to filter both rows and columns simultaneously.

In [155]:
# Select all rows for group 'M1' and columns 'A' to 'C'

df.loc["M1", "A":"C"]

            A         B         C
Num
1    2.706850  0.628133  0.907969
2    0.651118 -0.319318 -0.848077
3   -2.018168  0.740122  0.528813

- **``Selecting Rows and Columns``**: The line subset_m1_a_to_c = df.loc["M1", "A":"C"] retrieves all rows where the first level of the index is "M1" and the columns from "A" to "C".
- **``Displaying the Subset``**: The output shows the selected data, including only the specified rows and columns, while maintaining the MultiIndex structure for the rows.

<hr>

**The following expression selects a ``specific row`` from the DataFrame with a MultiIndex and also ``filter the columns from "A" to "C"``.**
- The use of **``double brackets [[ ]]``** ensures that the result is returned as a **``DataFrame``**, even when selecting a single row.

In [156]:
# Select the specific row for group 'M1' and Num 2, and columns 'A' to 'C'

df.loc[[("M1", 2)], "A":"C"]

                  A         B         C
Group Num
M1    2    0.651118 -0.319318 -0.848077

- **``Selecting a Specific Row and Columns``**: The line row_m1_2_a_to_c = df.loc[[("M1", 2)], "A":"C"] retrieves the row corresponding to the index ("M1", 2) and selects the columns from "A" to "C". The use of double brackets ensures that the result is a DataFrame.
- **``Displaying the Selected Row and Columns``**: The output shows the values for the specified row and the selected columns, maintaining the MultiIndex structure.

<hr>

**The following expression selects ``all rows`` from the DataFrame with a MultiIndex that fall within the range ``specified by the index labels "M1" and "M2"``.**
- This includes **``all rows``** that have the **``first level of the index between those two labels``**.

In [157]:
# Select all rows for group 'M1' to 'M2'

df.loc["M1":"M2"]

                  A         B         C         D
Group Num
M1    1    2.706850  0.628133  0.907969  0.503826
      2    0.651118 -0.319318 -0.848077  0.605965
      3   -2.018168  0.740122  0.528813 -0.589001
M2    1    0.188695 -0.758872 -0.933237  0.955057
      2    0.190794  1.978757  2.605967  0.683509
      3    0.302665  1.693723 -1.706086 -1.159119

- **``Selecting Rows from "M1" to "M2"``**: The line subset_m1_to_m2 = df.loc["M1":"M2"] retrieves all rows where the first level of the index is between "M1" and "M2", inclusive. This includes all rows for group "M1" and those for group "M2".
- **``Displaying the Selected Rows``**: The output shows all rows belonging to groups "M1" and "M2", along with their respective values for columns 'A', 'B', 'C', and 'D'.

<hr>

**The following expression selects a ``range of rows`` from the DataFrame with a MultiIndex.**
- This syntax is particularly useful for retrieving a **``subset of the DataFrame that spans multiple levels of the index``**.

In [158]:
# Select rows from ('M1', 2) to ('M2', 3)

df.loc[("M1", 2):("M2", 3)]

                  A         B         C         D
Group Num
M1    2    0.651118 -0.319318 -0.848077  0.605965
      3   -2.018168  0.740122  0.528813 -0.589001
M2    1    0.188695 -0.758872 -0.933237  0.955057
      2    0.190794  1.978757  2.605967  0.683509
      3    0.302665  1.693723 -1.706086 -1.159119

- **``Selecting a Range of Rows``**: The line subset_m1_2_to_m2_3 = df.loc[("M1", 2):("M2", 3)] retrieves all rows starting from the index ("M1", 2) to the index ("M2", 3), inclusive. This selection captures the specified rows across the levels of the MultiIndex.
- **``Displaying the Selected Range``**: The output shows the selected rows, along with their values in columns 'A', 'B', 'C', and 'D'.

<hr>

**The following expression selects a ``range of rows`` from the DataFrame with a MultiIndex, starting ``from the index ("M1", 2) and continuing until the last row associated with the first level index label "M2"``.**
- This means it will include **``all rows``** with the **``first level of the index``** up to and including those corresponding to **``"M2"``**.

In [159]:
# Select rows from ('M1', 2) to 'M2'

df.loc[("M1", 2): "M2"]

                  A         B         C         D
Group Num
M1    2    0.651118 -0.319318 -0.848077  0.605965
      3   -2.018168  0.740122  0.528813 -0.589001
M2    1    0.188695 -0.758872 -0.933237  0.955057
      2    0.190794  1.978757  2.605967  0.683509
      3    0.302665  1.693723 -1.706086 -1.159119

- **``Selecting a Range of Rows``**: The line subset_m1_2_to_m2 = df.loc[("M1", 2): "M2"] retrieves all rows starting from the index ("M1", 2) and continuing to all rows associated with the first index level "M2". This includes all rows for group "M1" from index 2 onward and all rows for group "M2".
- **``Displaying the Selected Rows``**: The output shows the selected rows along with their values in columns 'A', 'B', 'C', and 'D'.

<hr>

**The following expression selects ``specific rows`` from the DataFrame with a MultiIndex by specifying a list of tuples that represent the desired row indices.**
- This method is useful for **``extracting non-contiguous rows``** from the DataFrame.

In [160]:
# Select specific rows for ('M2', 3) and ('M3', 5)

df.loc[[("M2", 3), ("M3", 5)]]

                  A         B         C         D
Group Num
M2    3    0.302665  1.693723 -1.706086 -1.159119
M3    5   -0.134841  0.390528  0.166905  0.184502

- **``Selecting Specific Rows``**: The line **``selected_rows = df.loc[[("M2", 3), ("M3", 5)]]``** retrieves the rows corresponding to the **``indices ("M2", 3)``** and **``("M3", 5)``**. This allows you to **``access non-contiguous rows ``**efficiently.
- **``Displaying the Selected Rows``**: The output shows the specified rows along with their values in columns 'A', 'B', 'C', and 'D'.

<hr>

More information for Multiindex and Advanced Indexing, visit [**Pandas Official Documentation**](https://pandas.pydata.org/docs/user_guide/advanced.html)

## <p style="background-color:#E51A59; font-family:newtimeroman; color:#FFF9ED; font-size:175%; text-align:center; border-radius:10px 10px;">Some Other Useful Methods with Iris Dataset</p>

<a id="11"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

### Let's apply functions/attributes/methods we have learnt for "iris dataset"

In [ ]:
import seaborn as sns



<hr>

**The following function retrieves the names of the datasets available in the Seaborn library.**
- However, please note that this function should be executed in an environment where Seaborn is installed and functional, such as a Jupyter notebook or a Python script.

In [ ]:
# Display the names of available datasets in Seaborn library

sns.get_dataset_names()



<hr>

In [ ]:
# Load the Iris dataset
df = sns.load_dataset('iris')

# Display the first and last five rows of the DataFrame
df

- The Iris dataset includes the following columns:

  - **``sepal_length``**: Length of the sepal in centimeters.
  - **``sepal_width``**: Width of the sepal in centimeters.
  - **``petal_length``**: Length of the petal in centimeters.
  - **``petal_width``**: Width of the petal in centimeters.
  - **``species``**: The species of the iris flower (e.g., 'setosa', 'versicolor', 'virginica').

<hr>

**The ``df.head()`` function in pandas is used to display the first few rows of a DataFrame. By default, it shows the first 5 rows, but you can specify a different number of rows if desired.**

In [ ]:
# Display the first five rows of the DataFrame by default

df.head()



<hr>

**The ``shape`` attribute in pandas is used to get the dimensions of a DataFrame.**
- It returns a **``tuple``** representing the **``number of rows``** and **``columns``** in the DataFrame.

In [ ]:
# Get the shape of the DataFrame

df.shape

- **``150``**: The number of rows in the DataFrame (i.e., the total number of samples in the Iris dataset).
- **``5``**: The number of columns in the DataFrame (i.e., the features: sepal length, sepal width, petal length, petal width, and species).

<hr>

**The ``info()`` method in pandas provides a concise summary of a DataFrame, including information about the index, data types, non-null counts, and memory usage.**
- This method is particularly useful for quickly assessing the structure and contents of a DataFrame.

In [ ]:
# Get a summary of the DataFrame

df.info()

- **``RangeIndex``**: Indicates the number of entries (rows) in the DataFrame.
- **``Data columns``**: Lists the columns in the DataFrame along with:
- **``Column``**: The name of the column.
- **``Non-Null Count``**: The number of non-null (existing) entries in the column.
- **``Dtype``**: The data type of the column (e.g., float64 for numerical values and object for string values).
- **``Memory usage``**: Provides an estimate of the memory used by the DataFrame.

<hr>

**The ``sample(4)`` method in pandas is used to randomly select a specified number of rows from a DataFrame.**
- In this case, it will **``return 4 random rows``** from the DataFrame.

In [ ]:
# Randomly sample 4 rows from the DataFrame

df.sample(4)

- **``Random Sampling``**: The sample(4) method selects 4 random rows from the DataFrame. Each time you run the command, you may get different rows.
- **``No Replacement``**: By default, sampling is done without replacement, meaning the same row CANNOT be selected more than once in a single call.

<hr>

**The ``describe()`` method in pandas provides a statistical summary of the numerical columns in a DataFrame. This includes key statistics such as count, mean, standard deviation, minimum, maximum, and percentiles.**

In [ ]:
# Get a statistical summary of the DataFrame

df.describe()

- **``count``**: The number of non-null entries in each column.
- **``mean``**: The average value of each column.
- **``std``**: The standard deviation, which measures the amount of variation or dispersion of the values.
- **``min``**: The minimum value in each column.
- **``25%``**: The first quartile (25th percentile) value.
- **``50%``**: The median (50th percentile) value.
- **``75%``**: The third quartile (75th percentile) value.
- **``max``**: The maximum value in each column.

<hr>

**Using ``df.describe().transpose()`` in pandas provides a ``transposed view of the statistical summary`` of a DataFrame.**
- This means that the **``rows and columns are swapped``**, making it easier to read the summary statistics for each feature.

In [ ]:
# Get a statistical summary and transpose it

df.describe().transpose()
# df.describe().T

- **``Rows``**: Each row represents a feature (column) in the DataFrame (e.g., sepal_length, sepal_width, etc.).
- **``Columns``**: The columns represent the statistical measures:
- **``count``**: Number of non-null entries.
- **``mean``**: Average value.
- **``std``**: Standard deviation.
- **``min``**: Minimum value.
- **``25%, 50%, 75%``**: Percentiles.
- **``max``**: Maximum value.

<hr>

**Using ``df.describe(include="all")`` in pandas provides a ``comprehensive summary`` of the DataFrame, including statistics for ``both numeric`` and ``non-numeric (categorical) columns``.**
- This method helps you understand the distribution of your data, regardless of the data types.

In [ ]:
# Get a comprehensive statistical summary of the DataFrame

df.describe(include="all")

# "number" and "object" can be used as include/exclude parameter

- **``Numeric Columns``**: For numeric columns (sepal_length, sepal_width, petal_length, petal_width), the output includes:
  - **``count``**: Number of non-null entries.
  - **``mean``**: Average value.
  - **``std``**: Standard deviation.
  - **``min and max``**: Minimum and maximum values.
  - **``Percentiles``**: 25th, 50th (median), and 75th percentiles.
- **``Categorical Columns``**: For categorical columns (like species), the output includes:
  - **``unique``**: Number of unique values.
  - **``top``**: Most frequent value.
  - **``freq``**: Frequency of the most common value.

<hr>

**The ``corr()`` method in pandas is used to ``compute the pairwise correlation coefficients`` between the numerical columns of a DataFrame.**
- This method helps you understand the relationships between different features in your dataset.

In [ ]:
# Calculate the correlation matrix

df.corr()

- **``Correlation Coefficients``**: The values in the correlation matrix range from -1 to 1.
  - **``1``** indicates a perfect positive correlation (as one variable increases, the other also increases).
  - **``-1``** indicates a perfect negative correlation (as one variable increases, the other decreases).
  - **``0``** indicates no correlation.
- **``Diagonal Values``**: The diagonal values are all 1, as each variable is perfectly correlated with itself.

<hr>

**The following code extracts the ``correlation coefficients of all numerical columns`` in the DataFrame with respect to the ``sepal_length column`` specifically.**
- This method helps you identify which features are positively or negatively correlated with sepal_length.

In [ ]:
# Calculate the correlation matrix and extract correlations with sepal_length

df.corr()[["sepal_length"]]

- **``sepal_length``**: The correlation of sepal_length with itself is always 1.
- **``sepal_width``**: There is a slight negative correlation (-0.117569) with sepal_length, indicating that as sepal_length increases, sepal_width does not have a strong linear relationship.
- **``petal_length``**: There is a strong positive correlation (0.871754) with sepal_length, suggesting that increases in sepal_length are associated with increases in petal_length.
- **``petal_width``**: There is also a strong positive correlation (0.817254) with sepal_length.

<hr>

**The following expression calculates the ``Pearson correlation coefficient`` between ``the petal_length and petal_width`` columns in the DataFrame.**
- In our case, the resulting value of approximately **``0.9628654314027963``** indicates a **``very strong positive correlation``** between these two features.

In [ ]:
# Calculate the correlation between petal_length and petal_width

df['petal_length'].corr(df["petal_width"])

- **``Correlation Coefficient``**: The value ranges from -1 to 1:
  - **``1``** indicates a perfect positive correlation.
  - **``0``** indicates no correlation.
  - **``-1``** indicates a perfect negative correlation.
    - **``Value of 0.9629``**: This high value suggests that as the petal_length increases, the petal_width also tends to increase - **``significantly. This strong relationship can imply that these two features are closely related in the context of the Iris dataset.

<hr>

**The ``value_counts(dropna=False)`` method in pandas ``counts the occurrences of each unique value`` in the ``species column`` of the DataFrame.**
- Setting **``dropna=False``** ensures that **``any NaN (missing) values``** are also **``included in the count``**.

In [ ]:
# Count the occurrences of each species, including NaN values

df.species.value_counts(dropna=False)

- **``The output shows the counts of each unique value in the species column:
- **``setosa``**: 50 occurrences.
- **``versicolor``**: 50 occurrences.
- **``virginica``**: 50 occurrences.

Since the Iris dataset is well-structured without missing values in the species column, you would typically not see any NaN entries. However, if there were any NaN values, they would be counted and displayed in the output.

<hr>

**Using ``df['species'].value_counts(dropna=False, normalize=True)`` in pandas ``counts the occurrences of each unique value in the species column`` of the DataFrame and ``normalizes the counts`` to provide the ``relative frequencies (proportions)`` of each species in relation to the total count.**
- Setting **``dropna=False``** includes **``NaN (missing) values in the count if they exist``**.

In [ ]:
# Count occurrences of each species as a proportion of the total

df['species'].value_counts(dropna=False, normalize=True)

- The output shows the proportion of each unique value in the species column:
  - **``setosa``**: Approximately 33.33% of the data.
  - **``versicolor``**: Approximately 33.33% of the data.
  - **``virginica``**: Approximately 33.33% of the data.

<hr>

**The following ``unique()`` method returns an array of the ``unique values present`` in the ``species column`` of the DataFrame.**
- This is useful for understanding the different categories or classes in a categorical column.

In [ ]:
# Get the unique species values

df.species.unique()

- The output is a NumPy array containing the unique species present in the species column:
  - setosa
  - versicolor
  - virginica

This indicates that the Iris dataset consists of three distinct species of iris flowers.

<hr>

**The ``nunique()`` method returns the ``number of unique values`` in the ``species column`` of the DataFrame.**
- This is helpful for quickly determining **``how many distinct categories or classes are present``** in a categorical column.

In [ ]:
# Get the number of unique species values

df.species.nunique()

- The output 3 indicates that there are three unique species in the species column of the Iris dataset:
  - setosa
  - versicolor
  - virginica

<hr>

**The following expression ``filters the DataFrame`` to select the ``sepal_length values for all rows where the species is "setosa"``.**

In [ ]:
# Select sepal_length for species setosa

df.loc[df["species"] == "setosa", "sepal_length"]

- The output consists of the sepal_length values for all instances of the iris species "setosa".
- Each entry corresponds to a row in the original DataFrame where the species is "setosa", displaying the length of the sepals for those flowers.

<hr>

**The following expression ``filters the DataFrame`` to select ``rows where the sepal_length is greater than 4 and less than 5``.**

In [ ]:
# Filter the DataFrame for sepal_length between 4 and 5

df[(df.sepal_length > 4) & (df.sepal_length < 5)]

- The output consists of rows where the sepal_length is greater than 4 and less than 5.
- The DataFrame will include all columns for those filtered rows, showing the corresponding sepal_width, petal_length, petal_width, and species.

<hr>

**The following expression ``filters the DataFrame`` to select ``rows where the species is "virginica" and the sepal_length is greater than 4 and less than 5``.**

In [ ]:
# Filter the DataFrame for species 'virginica' with sepal_length between 4 and 5

df[(df.species == "virginica") & (df.sepal_length > 4)  & (df.sepal_length < 5)]

- The output will display a DataFrame containing rows where the species is "virginica" and the sepal_length falls between 4 and 5.
- If there are NO entries that meet these criteria, you will receive an empty DataFrame, as shown above. In the case of the Iris dataset, "virginica" typically has a sepal length that exceeds 5, so it's likely to be empty.

<hr>

**The following expression ``sorts the DataFrame`` based on the ``values in the sepal_length column in ascending order``.**

In [ ]:
# Sort the DataFrame by sepal_length in ascending order

df.sort_values(by='sepal_length', ascending=True)

- The output displays the DataFrame **``sorted by the sepal_length``** column in **``ascending order``**.
- Each row retains its associated data, and the order of the **``rows``** reflects the **``increasing values of sepal_length``**.

<hr>

<a id="12"></a>
<a href="#toc" class="btn btn-primary btn-sm" role="button" aria-pressed="true" 
style="color:blue; background-color:#dfa8e4" data-toggle="popover">Content</a>

## <p style="background-color:#FDFEFE; font-family:newtimeroman; color:#E51A59; font-size:150%; text-align:center; border-radius:10px 10px;">End of the Session - 04</p>

<!-- <p style="text-align: center;"><img src="https://i.ibb.co/RhJpNnJ/lunch-time.jpg" width="450" height="200" class="img-fluid" alt="Lunch Time"></p>
 -->
<p style="text-align: center;"><img src="https://i.ibb.co/TtRtYNn/healthy-lunch.jpg" width="800" height="200" class="img-fluid" alt="Lunch Time"></p>

<p style="text-align: center;"><img src="https://i.ibb.co/99DQ3TY/DS-Courses.png" class="img-fluid" 
alt="CLRSWY"></p>


<br><br><br>

<p style="text-align: center;"><img src="https://i.ibb.co/Rpz9L36/clarusway-logo-black.png" width="450" height="200" class="img-fluid" alt="CLRSWY_LOGO"></p>

<p style="background-color:#E51A59; font-family:newtimeroman; color:#FDFEFE; font-size:130%; text-align:center; border-radius:10px 10px;">WAY TO REINVENT YOURSELF</p>

<a href="https://clarusway.com/contact-us/"><img align="center" src="https://i.ibb.co/B43qn24/officially-licensed-logo.png" alt="Open in Clarusway LMS" width="110" height="200" title="This notebook is licensed by Clarusway IT training school. Please contact the authorized persons about the conditions under which you can use or share."></a>